RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal_rcc_ex.h
/**
  ******************************************************************************
  * @file    stm32h7rsxx_hal_rcc_ex.h
  * @author  MCD Application Team
  * @brief   Header file of RCC HAL Extension module.
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32H7RSxx_HAL_RCC_EX_H
#define STM32H7RSxx_HAL_RCC_EX_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7rsxx_hal_def.h"

/** @addtogroup STM32H7RSxx_HAL_Driver
  * @{
  */

/** @addtogroup RCCEx
  * @{
  */

/* Exported types ------------------------------------------------------------*/
/** @defgroup RCCEx_Exported_Types RCCEx Exported Types
  * @{
  */

/**
  * @brief  RCC PLL1 Clocks structure definition
  */

/**
  * @brief  RCC extended clocks structure definition
  */
typedef struct
{
  uint32_t PeriphClockSelection;   /*!< The Extended Clock to be configured.
                                        This parameter can be a value of @ref RCCEx_Periph_Clock_Selection */

  uint32_t FmcClockSelection;      /*!< Specifies FMC clock source
                                        This parameter can be a value of @ref RCCEx_FMC_Clock_Source    */

  uint32_t Xspi1ClockSelection;    /*!< Specifies XSPI1 clock source
                                        This parameter can be a value of @ref RCCEx_XSPI1_Clock_Source  */

  uint32_t Xspi2ClockSelection;    /*!< Specifies XSPI2 clock source
                                        This parameter can be a value of @ref RCCEx_XSPI2_Clock_Source  */

  uint32_t CkperClockSelection;   /*!< Specifies CKPER clock source
                                        This parameter can be a value of @ref RCCEx_CLKP_Clock_Source   */

  uint32_t AdcClockSelection;      /*!< Specifies ADC interface clock source
                                        This parameter can be a value of @ref RCCEx_ADC_Clock_Source     */

  uint32_t Adf1ClockSelection;     /*!< Specifies ADF1 Clock clock source
                                        This parameter can be a value of @ref RCCEx_ADF1_Clock_Source  */

  uint32_t CecClockSelection;      /*!< Specifies CEC clock source
                                        This parameter can be a value of @ref RCCEx_CEC_Clock_Source     */

  uint32_t Eth1RefClockSelection;     /*!< Specifies ETH1 REF clock source
                                        This parameter can be a value of @ref RCCEx_ETH1REF_Clock_Source   */

  uint32_t Eth1PhyClockSelection;   /*!< Specifies ETH1 PHY clock source
                                        This parameter can be a value of @ref RCCEx_ETH1PHY_Clock_Source   */

  uint32_t FdcanClockSelection;    /*!< Specifies FDCAN kernel clock source
                                        This parameter can be a value of @ref RCCEx_FDCAN_Clock_Source   */

  uint32_t I2c1_I3c1ClockSelection;     /*!< Specifies I2C1/I3C1 clock source
                                        This parameter can be a value of @ref RCCEx_I2C1_I3C1_Clock_Source    */

  uint32_t I2c23ClockSelection;    /*!< Specifies I2C2/I2C3 clock source
                                        This parameter can be a value of @ref RCCEx_I2C23_Clock_Source    */

  uint32_t Lptim1ClockSelection;   /*!< Specifies LPTIM1 clock source
                                        This parameter can be a value of @ref RCCEx_LPTIM1_Clock_Source  */

  uint32_t Lptim23ClockSelection;  /*!< Specifies LPTIM2/LPTIM3 clock source
                                        This parameter can be a value of @ref RCCEx_LPTIM23_Clock_Source  */

  uint32_t Lptim45ClockSelection;  /*!< Specifies LPTIM4/LPTIM5 clock source
                                        This parameter can be a value of @ref RCCEx_LPTIM45_Clock_Source  */

  uint32_t Lpuart1ClockSelection;  /*!< Specifies LPUART1 clock source
                                        This parameter can be a value of @ref RCCEx_LPUART1_Clock_Source */

  uint32_t LtdcClockSelection;     /*!< Specifies LPUART1 clock source
                                        This parameter can be a value of @ref RCCEx_LTDC_Clock_Source */

  uint32_t PssiClockSelection;     /*!< Specifies PSSI clock source
                                        This parameter can be a value of @ref RCCEx_PSSI_Clock_Source   */

  uint32_t Sai1ClockSelection;     /*!< Specifies SAI1 clock source
                                        This parameter can be a value of @ref RCCEx_SAI1_Clock_Source    */

  uint32_t Sai2ClockSelection;     /*!< Specifies SAI2 clock source
                                        This parameter can be a value of @ref RCCEx_SAI2_Clock_Source    */

  uint32_t Sdmmc12ClockSelection;  /*!< Specifies SDMMC clock source
                                        This parameter can be a value of @ref RCCEx_SDMMC12_Clock_Source  */

  uint32_t Spi1ClockSelection;     /*!< Specifies SPI1 clock source
                                        This parameter can be a value of @ref RCCEx_SPI1_Clock_Source    */

  uint32_t Spi23ClockSelection;    /*!< Specifies SPI2/SPI3 clock source
                                        This parameter can be a value of @ref RCCEx_SPI23_Clock_Source    */

  uint32_t Spi45ClockSelection;    /*!< Specifies SPI4/SPI5 clock source
                                        This parameter can be a value of @ref RCCEx_SPI45_Clock_Source    */

  uint32_t Spi6ClockSelection;     /*!< Specifies SPI6 clock source
                                        This parameter can be a value of @ref RCCEx_SPI6_Clock_Source    */

