RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal_rcc_ex.h
  uint32_t SpdifrxClockSelection;  /*!< Specifies SPDIFRX Clock clock source
                                        This parameter can be a value of @ref RCCEx_SPDIFRX_Clock_Source */

  uint32_t Usart1ClockSelection;   /*!< Specifies USART1 clock source
                                        This parameter can be a value of @ref RCCEx_USART1_Clock_Source  */

  uint32_t Usart234578ClockSelection; /*!< Specifies USART2/USART3/UART4/UART5/UART7/UART8 clock source
                                           This parameter can be a value of @ref RCCEx_USART234578_Clock_Source  */

  uint32_t UsbPhycClockSelection;  /*!< Specifies USB PHYC clock source
                                        This parameter can be a value of @ref RCCEx_USB_PHYC_Clock_Source */

  uint32_t UsbOtgFsClockSelection; /*!< Specifies USB OTG FS clock source
                                        This parameter can be a value of @ref RCCEx_USB_OTGFS_Clock_Source */

  uint32_t RTCClockSelection;      /*!< Specifies RTC Clock clock source
                                        This parameter can be a value of @ref RCC_RTC_Clock_Source       */

  uint32_t TIMPresSelection;       /*!< Specifies TIM Clock Prescalers Selection.
                                        This parameter can be a value of @ref RCCEx_TIM_Prescaler_Selection */
} RCC_PeriphCLKInitTypeDef;

/**
  * @brief RCC_CRS Init structure definition
  */
typedef struct
{
  uint32_t Prescaler;              /*!< Specifies the division factor of the SYNC signal.
                                        This parameter can be a value of @ref RCCEx_CRS_SynchroDivider  */

  uint32_t Source;                 /*!< Specifies the SYNC signal source.
                                        This parameter can be a value of @ref RCCEx_CRS_SynchroSource   */

  uint32_t Polarity;               /*!< Specifies the input polarity for the SYNC signal source.
                                        This parameter can be a value of @ref RCCEx_CRS_SynchroPolarity */

  uint32_t ReloadValue;            /*!< Specifies the value to be loaded in the frequency error counter with each SYNC event.
                                        It can be calculated in using macro __HAL_RCC_CRS_RELOADVALUE_CALCULATE(__FTARGET__, __FSYNC__)
                                        This parameter must be a number between 0 and 0xFFFF or a value of @ref RCCEx_CRS_ReloadValueDefault .*/

  uint32_t ErrorLimitValue;        /*!< Specifies the value to be used to evaluate the captured frequency error value.
                                        This parameter must be a number between 0 and 0xFF or a value of @ref RCCEx_CRS_ErrorLimitDefault */

  uint32_t HSI48CalibrationValue;  /*!< Specifies a user-programmable trimming value to the HSI48 oscillator.
                                        This parameter must be a number between 0 and 0x3F or a value of @ref RCCEx_CRS_HSI48CalibrationDefault */

} RCC_CRSInitTypeDef;

/**
  * @brief RCC_CRS Synchronization structure definition
  */
typedef struct
{
  uint32_t ReloadValue;            /*!< Specifies the value loaded in the Counter reload value.
                                        This parameter must be a number between 0 and 0xFFFF */

  uint32_t HSI48CalibrationValue;  /*!< Specifies value loaded in HSI48 oscillator smooth trimming.
                                        This parameter must be a number between 0 and 0x3F */

  uint32_t FreqErrorCapture;       /*!< Specifies the value loaded in the .FECAP, the frequency error counter
                                        value latched in the time of the last SYNC event.
                                        This parameter must be a number between 0 and 0xFFFF */

  uint32_t FreqErrorDirection;     /*!< Specifies the value loaded in the .FEDIR, the counting direction of the
                                        frequency error counter latched in the time of the last SYNC event.
                                        It shows whether the actual frequency is below or above the target.
                                        This parameter must be a value of @ref RCCEx_CRS_FreqErrorDirection*/

} RCC_CRSSynchroInfoTypeDef;

/**
  * @}
  */


/* Exported constants --------------------------------------------------------*/
/** @defgroup RCCEx_Exported_Constants  RCCEx Exported Constants
  * @{
  */

/** @defgroup RCCEx_Periph_Clock_Selection  Periph Clock Selection
  * @{
  */
#define RCC_PERIPHCLK_FMC          (0x00000001U)
#define RCC_PERIPHCLK_XSPI1        (0x00000002U)
#define RCC_PERIPHCLK_XSPI2        (0x00000004U)
#define RCC_PERIPHCLK_CKPER        (0x00000008U)
#define RCC_PERIPHCLK_ADC          (0x00000010U)
#define RCC_PERIPHCLK_ADF1         (0x00000020U)
#define RCC_PERIPHCLK_CEC          (0x00000040U)
#define RCC_PERIPHCLK_ETH1REF      (0x00000080U)
#define RCC_PERIPHCLK_ETH1PHY      (0x00000100U)
#define RCC_PERIPHCLK_FDCAN        (0x00000200U)
#define RCC_PERIPHCLK_I2C23        (0x00000400U)
#define RCC_PERIPHCLK_I2C1_I3C1    (0x00000800U)
#define RCC_PERIPHCLK_LPTIM1       (0x00001000U)
#define RCC_PERIPHCLK_LPTIM23      (0x00002000U)
#define RCC_PERIPHCLK_LPTIM45      (0x00004000U)
#define RCC_PERIPHCLK_LPUART1      (0x00008000U)
#define RCC_PERIPHCLK_LTDC         (0x00010000U)
#define RCC_PERIPHCLK_PSSI         (0x00020000U)
#define RCC_PERIPHCLK_RTC          (0x00040000U)
#define RCC_PERIPHCLK_SAI1         (0x00080000U)
#define RCC_PERIPHCLK_SAI2         (0x00100000U)
#define RCC_PERIPHCLK_SDMMC12      (0x00200000U)
#define RCC_PERIPHCLK_SPDIFRX      (0x00400000U)
#define RCC_PERIPHCLK_SPI1         (0x00800000U)
#define RCC_PERIPHCLK_SPI23        (0x01000000U)
#define RCC_PERIPHCLK_SPI45        (0x02000000U)
#define RCC_PERIPHCLK_SPI6         (0x04000000U)
#define RCC_PERIPHCLK_TIM          (0x08000000U)
#define RCC_PERIPHCLK_USART1       (0x10000000U)
#define RCC_PERIPHCLK_USART234578  (0x20000000U)
#define RCC_PERIPHCLK_USBPHYC      (0x40000000U)
#define RCC_PERIPHCLK_USBOTGFS     (0x80000000U)
/**
  * @}
  */

/** @defgroup RCCEx_FMC_Clock_Source  FMC Clock Source
  * @{
  */
#define RCC_FMCCLKSOURCE_HCLK          0U                        /*!< HCLK selection (default) */
#define RCC_FMCCLKSOURCE_PLL1Q         RCC_CCIPR1_FMCSEL_0       /*!< PLL 'Q' output selection */
#define RCC_FMCCLKSOURCE_PLL2R         RCC_CCIPR1_FMCSEL_1       /*!< PLL2 'R' output selection */
#define RCC_FMCCLKSOURCE_HSI           RCC_CCIPR1_FMCSEL         /*!< HSI selection */
#define RCC_FMCCLKSOURCE_HCLK_DIV4     (RCC_CKPROTR_FMCSWP_2 | RCC_CKPROTR_FMCSWP_0) /*!< HCLK/4 selection (recovery position) */
/**
  * @}
  */

/** @defgroup RCCEx_XSPI1_Clock_Source  XSPI1 Clock Source
  * @{
  */
#define RCC_XSPI1CLKSOURCE_HCLK        0U                     /*!< HCLK selection (default) */
#define RCC_XSPI1CLKSOURCE_PLL2S       RCC_CCIPR1_XSPI1SEL_0  /*!< PLL2 'S' output selection */
#define RCC_XSPI1CLKSOURCE_PLL2T       RCC_CCIPR1_XSPI1SEL_1  /*!< PLL2 'T' output selection */
#define RCC_XSPI1CLKSOURCE_HCLK_DIV4   RCC_CKPROTR_XSPI1SWP_2 /*!< HCLK/4 selection (recovery position) */
/**
  * @}
  */

