RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal_rcc_ex.h
/** @defgroup RCCEx_XSPI2_Clock_Source  XSPI2 Clock Source
  * @{
  */
#define RCC_XSPI2CLKSOURCE_HCLK        0U                     /*!< HCLK selection (default) */
#define RCC_XSPI2CLKSOURCE_PLL2S       RCC_CCIPR1_XSPI2SEL_0  /*!< PLL2 'S' output selection */
#define RCC_XSPI2CLKSOURCE_PLL2T       RCC_CCIPR1_XSPI2SEL_1  /*!< PLL2 'T' output selection */
#define RCC_XSPI2CLKSOURCE_HCLK_DIV4   RCC_CKPROTR_XSPI2SWP_2 /*!< HCLK/4 selection (recovery position) */
/**
  * @}
  */

/** @defgroup RCCEx_CLKP_Clock_Source  CLKP Clock Source
  * @{
  */
#define RCC_CLKPSOURCE_HSI         0U                          /*!< HSI selection (default) */
#define RCC_CLKPSOURCE_CSI         RCC_CCIPR1_CKPERSEL_0     /*!< CSI selection */
#define RCC_CLKPSOURCE_HSE         RCC_CCIPR1_CKPERSEL_1     /*!< HSE selection */
/**
  * @}
  */

/** @defgroup RCCEx_ADC_Clock_Source  ADC Clock Source
  * @{
  */
#define RCC_ADCCLKSOURCE_PLL2P     0U                      /*!< PLL2 'P' output selection (default) */
#define RCC_ADCCLKSOURCE_PLL3R     RCC_CCIPR1_ADCSEL_0   /*!< PLL3 'R' output selection */
#define RCC_ADCCLKSOURCE_CLKP      RCC_CCIPR1_ADCSEL_1   /*!< Clock peripheral output selection */
/**
  * @}
  */

/** @defgroup RCCEx_ADF1_Clock_Source  ADF1 Clock Source
  * @{
  */
#define RCC_ADF1CLKSOURCE_HCLK     0U                        /*!< HCLK selection (default) */
#define RCC_ADF1CLKSOURCE_PLL2P    RCC_CCIPR1_ADF1SEL_0    /*!< PLL2 'P' output selection */
#define RCC_ADF1CLKSOURCE_PLL3P    RCC_CCIPR1_ADF1SEL_1    /*!< PLL3 'P' output selection */
#define RCC_ADF1CLKSOURCE_PIN      (RCC_CCIPR1_ADF1SEL_1 |  RCC_CCIPR1_ADF1SEL_0) /*!< External I2S_PIN selection */
#define RCC_ADF1CLKSOURCE_CSI      RCC_CCIPR1_ADF1SEL_2    /*!< CSI selection */
#define RCC_ADF1CLKSOURCE_HSI      (RCC_CCIPR1_ADF1SEL_2 |  RCC_CCIPR1_ADF1SEL_0) /*!< HSI selection */
/**
  * @}
  */

/** @defgroup RCCEx_CEC_Clock_Source  CEC Clock Source
  * @{
  */
#define RCC_CECCLKSOURCE_LSE       0U                          /*!< LSE selection (default) */
#define RCC_CECCLKSOURCE_LSI       RCC_CCIPR2_CECSEL_0      /*!< LSI selection */
#define RCC_CECCLKSOURCE_CSI       RCC_CCIPR2_CECSEL_1      /*!< CSI divided by 122 selection */
/**
  * @}
  */

/** @defgroup RCCEx_ETH1REF_Clock_Source  ETH1 REF Clock Source
  * @{
  */
#define RCC_ETH1REFCLKSOURCE_PHY      0U                          /*!< ETH PHY selection (default) */
#define RCC_ETH1REFCLKSOURCE_HSE      RCC_CCIPR1_ETH1REFCKSEL_0   /*!< HSE selection */
#define RCC_ETH1REFCLKSOURCE_ETH      RCC_CCIPR1_ETH1REFCKSEL_1   /*!< ETH Feedback output selection */
/**
  * @}
  */

/** @defgroup RCCEx_ETH1PHY_Clock_Source  ETH1 PHY Clock Source
  * @{
  */
#define RCC_ETH1PHYCLKSOURCE_HSE    0U                         /*!< HSE selection (default) */
#define RCC_ETH1PHYCLKSOURCE_PLL3S  RCC_CCIPR1_ETH1PHYCKSEL      /*!< PLL3 'S' output selection */
/**
  * @}
  */

/** @defgroup RCCEx_FDCAN_Clock_Source  FDCAN Kernel Clock Source
  * @{
  */
#define RCC_FDCANCLKSOURCE_HSE     0U                          /*!< HSE selection (default) */
#define RCC_FDCANCLKSOURCE_PLL1Q   RCC_CCIPR2_FDCANSEL_0    /*!< PLL1 'Q' output selection */
#define RCC_FDCANCLKSOURCE_PLL2P   RCC_CCIPR2_FDCANSEL_1    /*!< PLL2 'P' output selection */
/**
  * @}
  */

/** @defgroup RCCEx_I2C23_Clock_Source  I2C2/I2C3 Clock Source
  * @{
  */
#define RCC_I2C23CLKSOURCE_PCLK1   0U                          /*!< PCLK1 selection (default) */
#define RCC_I2C23CLKSOURCE_PLL3R   RCC_CCIPR2_I2C23SEL_0    /*!< PLL3 'R' output selection */
#define RCC_I2C23CLKSOURCE_HSI     RCC_CCIPR2_I2C23SEL_1    /*!< HSI selection */
#define RCC_I2C23CLKSOURCE_CSI     (RCC_CCIPR2_I2C23SEL_1 | RCC_CCIPR2_I2C23SEL_0) /*!< CSI selection */
/**
  * @}
  */

/** @defgroup RCCEx_I2C1_I3C1_Clock_Source  I2C1/I3C1Clock Source
  * @{
  */
#define RCC_I2C1_I3C1CLKSOURCE_PCLK1    0U                            /*!< PCLK1 selection (default) */
#define RCC_I2C1_I3C1CLKSOURCE_PLL3R    RCC_CCIPR2_I2C1_I3C1SEL_0  /*!< PLL3 'R' output selection */
#define RCC_I2C1_I3C1CLKSOURCE_HSI      RCC_CCIPR2_I2C1_I3C1SEL_1  /*!< HSI selection */
#define RCC_I2C1_I3C1CLKSOURCE_CSI      (RCC_CCIPR2_I2C1_I3C1SEL_1 | RCC_CCIPR2_I2C1_I3C1SEL_0) /*!< CSI selection */
/**
  * @}
  */

/** @defgroup RCCEx_LPTIM1_Clock_Source  LPTIM1 Clock Source
  * @{
  */
#define RCC_LPTIM1CLKSOURCE_PCLK1  0U                          /*!< PCLK1 selection (default) */
#define RCC_LPTIM1CLKSOURCE_PLL2P  RCC_CCIPR2_LPTIM1SEL_0   /*!< PLL2 'P' output selection */
#define RCC_LPTIM1CLKSOURCE_PLL3R  RCC_CCIPR2_LPTIM1SEL_1   /*!< PLL3 'R' output selection */
#define RCC_LPTIM1CLKSOURCE_LSE    (RCC_CCIPR2_LPTIM1SEL_1 | RCC_CCIPR2_LPTIM1SEL_0) /*!< LSE selection */
#define RCC_LPTIM1CLKSOURCE_LSI    RCC_CCIPR2_LPTIM1SEL_2   /*!< LSI selection */
#define RCC_LPTIM1CLKSOURCE_CLKP   (RCC_CCIPR2_LPTIM1SEL_2 | RCC_CCIPR2_LPTIM1SEL_0) /*!< Clock peripheral output selection */
/**
  * @}
  */

/** @defgroup RCCEx_LPTIM23_Clock_Source  LPTIM2/LPTIM3 Clock Source
  * @{
  */
#define RCC_LPTIM23CLKSOURCE_PCLK4  0U                          /*!< PCLK4 selection (default) */
#define RCC_LPTIM23CLKSOURCE_PLL2P  RCC_CCIPR4_LPTIM23SEL_0 /*!< PLL2 'P' output selection */
#define RCC_LPTIM23CLKSOURCE_PLL3R  RCC_CCIPR4_LPTIM23SEL_1 /*!< PLL3 'R' output selection */
#define RCC_LPTIM23CLKSOURCE_LSE    (RCC_CCIPR4_LPTIM23SEL_1 | RCC_CCIPR4_LPTIM23SEL_0) /*!< LSE selection */
#define RCC_LPTIM23CLKSOURCE_LSI    RCC_CCIPR4_LPTIM23SEL_2 /*!< LSI selection */
#define RCC_LPTIM23CLKSOURCE_CLKP   (RCC_CCIPR4_LPTIM23SEL_2 | RCC_CCIPR4_LPTIM23SEL_0) /*!< Clock peripheral output selection */
/**
  * @}
  */

/** @defgroup RCCEx_LPTIM45_Clock_Source  LPTIM4/LPTIM5 Clock Source
  * @{
  */
#define RCC_LPTIM45CLKSOURCE_PCLK4  0U                          /*!< PCLK4 selection (default) */
#define RCC_LPTIM45CLKSOURCE_PLL2P  RCC_CCIPR4_LPTIM45SEL_0 /*!< PLL2 'P' output selection */
#define RCC_LPTIM45CLKSOURCE_PLL3R  RCC_CCIPR4_LPTIM45SEL_1 /*!< PLL3 'R' output selection */
#define RCC_LPTIM45CLKSOURCE_LSE    (RCC_CCIPR4_LPTIM45SEL_1 | RCC_CCIPR4_LPTIM45SEL_0) /*!< LSE selection */
#define RCC_LPTIM45CLKSOURCE_LSI    RCC_CCIPR4_LPTIM45SEL_2 /*!< LSI selection */
#define RCC_LPTIM45CLKSOURCE_CLKP   (RCC_CCIPR4_LPTIM45SEL_2 | RCC_CCIPR4_LPTIM45SEL_0) /*!< Clock peripheral output selection */
/**
  * @}
  */

/** @defgroup RCCEx_LPUART1_Clock_Source  LPUART1 Clock Source
  * @{
  */
#define RCC_LPUART1CLKSOURCE_PCLK4  0U                            /*!< PCLK4 selection (default) */
#define RCC_LPUART1CLKSOURCE_PLL2Q  RCC_CCIPR4_LPUART1SEL_0   /*!< PLL2 'Q' output selection */
#define RCC_LPUART1CLKSOURCE_PLL3Q  RCC_CCIPR4_LPUART1SEL_1   /*!< PLL2 'Q' output selection */
#define RCC_LPUART1CLKSOURCE_HSI    (RCC_CCIPR4_LPUART1SEL_1 | RCC_CCIPR4_LPUART1SEL_0)  /*!< HSI selection */
#define RCC_LPUART1CLKSOURCE_CSI    RCC_CCIPR4_LPUART1SEL_2   /*!< CSI selection */
#define RCC_LPUART1CLKSOURCE_LSE    (RCC_CCIPR4_LPUART1SEL_2 | RCC_CCIPR4_LPUART1SEL_0)  /*!< LSE selection */
/**
  * @}
  */

/** @defgroup RCCEx_LTDC_Clock_Source  LTDC Clock Source
  * @{
  */
#define RCC_LTDCCLKSOURCE_PLL3R     0U                            /*!< PLL3 'R' output selection (unique) */
/**
  * @}
  */

