RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal_rcc_ex.h
/** @defgroup RCCEx_PSSI_Clock_Source  PSSI Clock Source
  * @{
  */
#define RCC_PSSICLKSOURCE_PLL3R   0U                           /*!< PLL3 'R' output selection (default) */
#define RCC_PSSICLKSOURCE_CLKP    RCC_CCIPR1_PSSISEL         /*!< Clock peripheral output selection */
/**
  * @}
  */

/** @defgroup RCCEx_SAI1_Clock_Source SAI1 Clock Source
  * @{
  */
#define RCC_SAI1CLKSOURCE_PLL1Q    0U                          /*!< PLL1 'Q' output selection (default) */
#define RCC_SAI1CLKSOURCE_PLL2P    RCC_CCIPR3_SAI1SEL_0     /*!< PLL2 'P' output selection */
#define RCC_SAI1CLKSOURCE_PLL3P    RCC_CCIPR3_SAI1SEL_1     /*!< PLL3 'P' output selection */
#define RCC_SAI1CLKSOURCE_PIN      (RCC_CCIPR3_SAI1SEL_1 | RCC_CCIPR3_SAI1SEL_0)  /*!< I2S_PIN selection */
#define RCC_SAI1CLKSOURCE_CLKP     RCC_CCIPR3_SAI1SEL_2     /*!< Clock peripheral output selection */
/**
  * @}
  */

/** @defgroup RCCEx_SAI2_Clock_Source SAI2 Clock Source
  * @{
  */
#define RCC_SAI2CLKSOURCE_PLL1Q    0U                          /*!< PLL1 'Q' output selection (default) */
#define RCC_SAI2CLKSOURCE_PLL2P    RCC_CCIPR3_SAI2SEL_0     /*!< PLL2 'P' output selection */
#define RCC_SAI2CLKSOURCE_PLL3P    RCC_CCIPR3_SAI2SEL_1     /*!< PLL3 'P' output selection */
#define RCC_SAI2CLKSOURCE_PIN      (RCC_CCIPR3_SAI2SEL_1 | RCC_CCIPR3_SAI2SEL_0)  /*!< I2S_PIN selection */
#define RCC_SAI2CLKSOURCE_CLKP     RCC_CCIPR3_SAI2SEL_2     /*!< Clock peripheral output selection */
#define RCC_SAI2CLKSOURCE_SPDIF    (RCC_CCIPR3_SAI2SEL_2 | RCC_CCIPR3_SAI2SEL_0)  /*!< SPDIF output selection */
/**
  * @}
  */

/** @defgroup RCCEx_SDMMC12_Clock_Source  SDMMC Clock Source
  * @{
  */
#define RCC_SDMMC12CLKSOURCE_PLL2S   0U                          /*!< PLL2 'S' output selection (default) */
#define RCC_SDMMC12CLKSOURCE_PLL2T   RCC_CCIPR1_SDMMC12SEL       /*!< PLL2 'T' output selection */
/**
  * @}
  */

/** @defgroup RCCEx_SPDIFRX_Clock_Source  SPDIFRX Clock Source
  * @{
  */
#define RCC_SPDIFRXCLKSOURCE_PLL1Q 0U                          /*!< PLL1 'Q' output selection (default) */
#define RCC_SPDIFRXCLKSOURCE_PLL2R RCC_CCIPR2_SPDIFRXSEL_0  /*!< PLL2 'R' output selection */
#define RCC_SPDIFRXCLKSOURCE_PLL3R RCC_CCIPR2_SPDIFRXSEL_1  /*!< PLL3 'R' output selection */
#define RCC_SPDIFRXCLKSOURCE_HSI   RCC_CCIPR2_SPDIFRXSEL    /*!< HSI selection */
/**
  * @}
  */

/** @defgroup RCCEx_SPI1_Clock_Source  SPI1 Clock Source
  * @{
  */
#define RCC_SPI1CLKSOURCE_PLL1Q    0U                          /*!< PLL1 'Q' output selection (default) */
#define RCC_SPI1CLKSOURCE_PLL2P    RCC_CCIPR3_SPI1SEL_0     /*!< PLL2 'P' output selection */
#define RCC_SPI1CLKSOURCE_PLL3P    RCC_CCIPR3_SPI1SEL_1     /*!< PLL3 'P' output selection */
#define RCC_SPI1CLKSOURCE_PIN      (RCC_CCIPR3_SPI1SEL_1 | RCC_CCIPR3_SPI1SEL_0)  /*!< I2S_PIN selection */
#define RCC_SPI1CLKSOURCE_CLKP     RCC_CCIPR3_SPI1SEL_2     /*!< Clock peripheral output selection */
/**
  * @}
  */

/** @defgroup RCCEx_SPI23_Clock_Source  SPI2/SPI3 Clock Source
  * @{
  */
#define RCC_SPI23CLKSOURCE_PLL1Q   0U                          /*!< PLL1 'Q' output selection (default) */
#define RCC_SPI23CLKSOURCE_PLL2P   RCC_CCIPR2_SPI23SEL_0    /*!< PLL2 'P' output selection */
#define RCC_SPI23CLKSOURCE_PLL3P   RCC_CCIPR2_SPI23SEL_1    /*!< PLL3 'P' output selection */
#define RCC_SPI23CLKSOURCE_PIN     (RCC_CCIPR2_SPI23SEL_1 | RCC_CCIPR2_SPI23SEL_0)  /*!< I2S_PIN selection */
#define RCC_SPI23CLKSOURCE_CLKP    RCC_CCIPR2_SPI23SEL_2    /*!< Clock peripheral output selection */
/**
  * @}
  */

/** @defgroup RCCEx_SPI45_Clock_Source  SPI4/SPI5 Clock Source
  * @{
  */
#define RCC_SPI45CLKSOURCE_PCLK2   0U                          /*!< PCLK2 selection (default) */
#define RCC_SPI45CLKSOURCE_PLL2Q   RCC_CCIPR3_SPI45SEL_0    /*!< PLL2 'Q' output selection */
#define RCC_SPI45CLKSOURCE_PLL3Q   RCC_CCIPR3_SPI45SEL_1    /*!< PLL3 'Q' output selection */
#define RCC_SPI45CLKSOURCE_HSI     (RCC_CCIPR3_SPI45SEL_1 | RCC_CCIPR3_SPI45SEL_0)  /*!< HSI selection */
#define RCC_SPI45CLKSOURCE_CSI     RCC_CCIPR3_SPI45SEL_2    /*!< CSI selection */
#define RCC_SPI45CLKSOURCE_HSE     (RCC_CCIPR3_SPI45SEL_2 | RCC_CCIPR3_SPI45SEL_0)  /*!< HSE selection */
/**
  * @}
  */

/** @defgroup RCCEx_SPI6_Clock_Source  SPI6 Clock Source
  * @{
  */
#define RCC_SPI6CLKSOURCE_PCLK4    0U                          /*!< PCLK4 selection (default) */
#define RCC_SPI6CLKSOURCE_PLL2Q    RCC_CCIPR4_SPI6SEL_0    /*!< PLL2 'Q' output selection */
#define RCC_SPI6CLKSOURCE_PLL3Q    RCC_CCIPR4_SPI6SEL_1    /*!< PLL3 'Q' output selection */
#define RCC_SPI6CLKSOURCE_HSI      (RCC_CCIPR4_SPI6SEL_1 | RCC_CCIPR4_SPI6SEL_0)  /*!< HSI selection */
#define RCC_SPI6CLKSOURCE_CSI      RCC_CCIPR4_SPI6SEL_2    /*!< CSI selection */
#define RCC_SPI6CLKSOURCE_HSE      (RCC_CCIPR4_SPI6SEL_2 | RCC_CCIPR4_SPI6SEL_0)  /*!< HSE selection */
/**
  * @}
  */

/** @defgroup RCCEx_TIM_Prescaler_Selection TIM Prescaler Selection
  * @{
  */
#define RCC_TIMPRES_DISABLE   0U                         /*!< Timers clocks prescaler not set (default) */
#define RCC_TIMPRES_ENABLE    RCC_CFGR_TIMPRE            /*!< Timers clocks prescaler set */

/**
  * @}
  */

/** @defgroup RCCEx_USART1_Clock_Source  USART1 Clock Source
  * @{
  */
#define RCC_USART1CLKSOURCE_PCLK2  0U                          /*!< PCLK2 selection (default) */
#define RCC_USART1CLKSOURCE_PLL2Q  RCC_CCIPR3_USART1SEL_0   /*!< PLL2 'Q' output selection */
#define RCC_USART1CLKSOURCE_PLL3Q  RCC_CCIPR3_USART1SEL_1   /*!< PLL2 'Q' output selection */
#define RCC_USART1CLKSOURCE_HSI    (RCC_CCIPR3_USART1SEL_1 | RCC_CCIPR3_USART1SEL_0)  /*!< HSI selection */
#define RCC_USART1CLKSOURCE_CSI    RCC_CCIPR3_USART1SEL_2   /*!< CSI selection */
#define RCC_USART1CLKSOURCE_LSE    (RCC_CCIPR3_USART1SEL_2 | RCC_CCIPR3_USART1SEL_0)  /*!< LSE selection */
/**
  * @}
  */

/** @defgroup RCCEx_USART234578_Clock_Source  USART2/USART3/UART4/UART5/UART7/UART8 Clock Source
  * @{
  */
#define RCC_USART234578CLKSOURCE_PCLK1  0U                            /*!< PCLK1 selection (default) */
#define RCC_USART234578CLKSOURCE_PLL2Q  RCC_CCIPR2_UART234578SEL_0 /*!< PLL2 'Q' output selection */
#define RCC_USART234578CLKSOURCE_PLL3Q  RCC_CCIPR2_UART234578SEL_1 /*!< PLL3 'Q' output selection */
#define RCC_USART234578CLKSOURCE_HSI    (RCC_CCIPR2_UART234578SEL_1 | RCC_CCIPR2_UART234578SEL_0)  /*!< HSI selection */
#define RCC_USART234578CLKSOURCE_CSI    RCC_CCIPR2_UART234578SEL_2   /*!< CSI selection */
#define RCC_USART234578CLKSOURCE_LSE    (RCC_CCIPR2_UART234578SEL_2 | RCC_CCIPR2_UART234578SEL_0)  /*!< LSE selection */
/**
  * @}
  */

/** @defgroup RCCEx_USB_PHYC_Clock_Source  USB PHYC Clock Source
  * @{
  */
#define RCC_USBPHYCCLKSOURCE_HSE       0U                        /*!< HSE selection (default) */
#define RCC_USBPHYCCLKSOURCE_HSE_DIV2  RCC_CCIPR1_USBPHYCSEL_0 /*!< HSE div 2 selection */
#define RCC_USBPHYCCLKSOURCE_PLL3Q     RCC_CCIPR1_USBPHYCSEL_1 /*!< PLL3 'Q' output selection */
/**
  * @}
  */

/** @defgroup RCCEx_USB_OTGFS_Clock_Source  USB OTG FS Clock Source
  * @{
  */
#define RCC_USBOTGFSCLKSOURCE_HSI48    0U                      /*!< HSI48 selection (default) */
#define RCC_USBOTGFSCLKSOURCE_PLL3Q    RCC_CCIPR1_OTGFSSEL_0 /*!< PLL3 'Q' output selection */
#define RCC_USBOTGFSCLKSOURCE_HSE      RCC_CCIPR1_OTGFSSEL_1 /*!< HSE selection */
#define RCC_USBOTGFSCLKSOURCE_CLK48    RCC_CCIPR1_OTGFSSEL   /*!< USBPHYC CLK48 output selection */
/**
  * @}
  */

