RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal_rcc_ex.h
/** @brief  Macro to get the ADF1 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_ADF1CLKSOURCE_HCLK   HCLK Clock selected as ADF1 clock
  *            @arg RCC_ADF1CLKSOURCE_PLL2P  PLL2_P Clock selected as ADF1 clock
  *            @arg RCC_ADF1CLKSOURCE_PLL3P  PLL3_P Clock selected as ADF1 clock
  *            @arg RCC_ADF1CLKSOURCE_PIN    External I2S_CKIN selected as ADF1 clock
  *            @arg RCC_ADF1CLKSOURCE_CSI    CSI selected as ADF1 clock
  *            @arg RCC_ADF1CLKSOURCE_HSI    HSI selected as ADF1 clock
  */
#define __HAL_RCC_GET_ADF1_SOURCE() ((uint32_t)(READ_BIT(RCC->CCIPR1, RCC_CCIPR1_ADF1SEL)))

/** @brief  Macro to configure the HDMI-CEC clock source.
  * @param  __CEC_CLKSOURCE__ specifies the CEC clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_CECCLKSOURCE_LSE  LSE selected as CEC clock
  *            @arg RCC_CECCLKSOURCE_LSI  LSI selected as CEC clock
  *            @arg RCC_CECCLKSOURCE_CSI  CSI divided by 122 selected as CEC clock
  */
#define __HAL_RCC_CEC_CONFIG(__CEC_CLKSOURCE__) \
  MODIFY_REG(RCC->CCIPR2, RCC_CCIPR2_CECSEL, (uint32_t)(__CEC_CLKSOURCE__))

/** @brief  Macro to get the HDMI-CEC clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_CECCLKSOURCE_LSE  LSE selected as CEC clock
  *            @arg RCC_CECCLKSOURCE_LSI  LSI selected as CEC clock
  *            @arg RCC_CECCLKSOURCE_CSI  CSI divided by 122 selected as CEC clock
  */
#define __HAL_RCC_GET_CEC_SOURCE() ((uint32_t)(READ_BIT(RCC->CCIPR2, RCC_CCIPR2_CECSEL)))

/** @brief  Macro to configure the CLKP : Oscillator clock for peripheral
  * @param  __CLKP_CLKSOURCE__ specifies Oscillator clock for peripheral
  *         This parameter can be one of the following values:
  *            @arg RCC_CLKPSOURCE_HSI  HSI selected as peripheral clock (default)
  *            @arg RCC_CLKPSOURCE_CSI  CSI selected as peripheral clock
  *            @arg RCC_CLKPSOURCE_HSE  HSE selected as peripheral clock
  */
#define __HAL_RCC_CLKP_CONFIG(__CLKP_CLKSOURCE__) \
  MODIFY_REG(RCC->CCIPR1, RCC_CCIPR1_CKPERSEL, (uint32_t)(__CLKP_CLKSOURCE__))

/** @brief  Macro to get the Oscillator clock for peripheral source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_CLKPSOURCE_HSI  HSI selected as peripheral clock (default)
  *            @arg RCC_CLKPSOURCE_CSI  CSI selected as peripheral clock
  *            @arg RCC_CLKPSOURCE_HSE  HSE selected as peripheral clock
  */
#define __HAL_RCC_GET_CLKP_SOURCE() ((uint32_t)(READ_BIT(RCC->CCIPR1, RCC_CCIPR1_CKPERSEL)))

/** @brief  Macro to configure the ETH1 REF clock source.
  * @param  __ETH1REF_CLKSOURCE__ specifies  clock source for ETH1 REF
  *         This parameter can be one of the following values:
  *            @arg RCC_ETH1REFCLKSOURCE_PHY      ETH PHY selected as ETH1 REF clock (default)
  *            @arg RCC_ETH1REFCLKSOURCE_HSE      HSE selected as ETH1 clock
  *            @arg RCC_ETH1REFCLKSOURCE_ETH      ETH feedback selected as ETH1 REF clock
  */
#define __HAL_RCC_ETH1REF_CONFIG(__ETH1REF_CLKSOURCE__) \
  MODIFY_REG(RCC->CCIPR1, RCC_CCIPR1_ETH1REFCKSEL, (uint32_t)(__ETH1REF_CLKSOURCE__))

/** @brief  Macro to get the ETH1 REF clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_ETH1REFCLKSOURCE_PHY      ETH PHY selected as ETH1 clock (default)
  *            @arg RCC_ETH1REFCLKSOURCE_HSE      HSE selected as ETH1 clock
  *            @arg RCC_ETH1REFCLKSOURCE_ETH      ETH feedback selected as ETH1 clock
  */
#define __HAL_RCC_GET_ETH1REF_SOURCE() ((uint32_t)(READ_BIT(RCC->CCIPR1, RCC_CCIPR1_ETH1REFCKSEL)))

/** @brief  Macro to configure the ETH1 PHY clock source.
  * @param  __ETH1PHY_CLKSOURCE__ specifies  clock source for ETH PHY
  *         This parameter can be one of the following values:
  *            @arg RCC_ETH1PHYCLKSOURCE_HSE    HSE selected as ETH PHY clock (default)
  *            @arg RCC_ETH1PHYCLKSOURCE_PLL3S  PLL3_S selected as ETH PHY clock
  */
#define __HAL_RCC_ETH1PHY_CONFIG(__ETH1PHY_CLKSOURCE__) \
  MODIFY_REG(RCC->CCIPR1, RCC_CCIPR1_ETH1PHYCKSEL, (uint32_t)(__ETH1PHY_CLKSOURCE__))

/** @brief  Macro to get the ETH1 PHY clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_ETH1PHYCLKSOURCE_HSE    HSE selected as ETH PHY clock (default)
  *            @arg RCC_ETH1PHYCLKSOURCE_PLL3S  PLL3_S selected as ETH PHY clock
  */
#define __HAL_RCC_GET_ETH1PHY_SOURCE() ((uint32_t)(READ_BIT(RCC->CCIPR1, RCC_CCIPR1_ETH1PHYCKSEL)))

/** @brief  Macro to configure the FDCAN kernel clock source.
  * @param  __FDCAN_CLKSOURCE__ specifies  clock source for FDCAN kernel
  *         This parameter can be one of the following values:
  *            @arg RCC_FDCANCLKSOURCE_HSE    HSE selected as FDCAN kernel clock (default)
  *            @arg RCC_FDCANCLKSOURCE_PLL1Q  PLL1_Q selected as FDCAN kernel clock
  *            @arg RCC_FDCANCLKSOURCE_PLL2P  PLL2_P selected as FDCAN kernel clock
  */
#define __HAL_RCC_FDCAN_CONFIG(__FDCAN_CLKSOURCE__) \
  MODIFY_REG(RCC->CCIPR2, RCC_CCIPR2_FDCANSEL, (uint32_t)(__FDCAN_CLKSOURCE__))

/** @brief  Macro to get the FDCAN kernel clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_FDCANCLKSOURCE_HSE    HSE selected as FDCAN kernel clock (default)
  *            @arg RCC_FDCANCLKSOURCE_PLL1Q  PLL1_Q selected as FDCAN kernel clock
  *            @arg RCC_FDCANCLKSOURCE_PLL2P  PLL2_P selected as FDCAN kernel clock
  */
#define __HAL_RCC_GET_FDCAN_SOURCE() ((uint32_t)(READ_BIT(RCC->CCIPR2, RCC_CCIPR2_FDCANSEL)))

/** @brief  Macro to configure the FMC clock source.
  *
  * @param  __FMC_CLKSOURCE__ specifies the FMC clock source.
  *            @arg RCC_FMCCLKSOURCE_HCLK  HCLK Clock selected as FMC clock
  *            @arg RCC_FMCCLKSOURCE_PLL1Q PLL1_Q Clock selected as FMC clock
  *            @arg RCC_FMCCLKSOURCE_PLL2R PLL2_R Clock selected as FMC clock
  *            @arg RCC_FMCCLKSOURCE_HSI   HSI selected as FMC clock
  */
#define __HAL_RCC_FMC_CONFIG(__FMC_CLKSOURCE__) \
  MODIFY_REG(RCC->CCIPR1, RCC_CCIPR1_FMCSEL, (uint32_t)(__FMC_CLKSOURCE__))

