RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal_rcc_ex.h
/** @brief  Macro to get the FMC clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_FMCCLKSOURCE_HCLK      HCLK Clock selected as FMC clock
  *            @arg RCC_FMCCLKSOURCE_PLL1Q     PLL1_Q Clock selected as FMC clock
  *            @arg RCC_FMCCLKSOURCE_PLL2R     PLL2_R Clock selected as FMC clock
  *            @arg RCC_FMCCLKSOURCE_HSI       HSI selected as FMC clock
  *            @arg RCC_FMCCLKSOURCE_HCLK_DIV4 Recovery Clock selected as FMC clock
  */
#define __HAL_RCC_GET_FMC_SOURCE() ((READ_BIT(RCC->CKPROTR, RCC_CKPROTR_FMCSWP) == RCC_FMCCLKSOURCE_HCLK_DIV4) ? \
                                    RCC_FMCCLKSOURCE_HCLK_DIV4 : ((uint32_t)(READ_BIT(RCC->CCIPR1, RCC_CCIPR1_FMCSEL))))

/** @brief  Macro to configure the I2C1/I3C1 clock source.
  * @param  __I2C1_I3C1_CLKSOURCE__ specifies the I2C1/I3C1clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_I2C1_I3C1CLKSOURCE_PCLK1  APB1 selected as I2C1/I3C1clock
  *            @arg RCC_I2C1_I3C1CLKSOURCE_PLL3R  PLL3_R selected as I2C1/I3C1clock
  *            @arg RCC_I2C1_I3C1CLKSOURCE_HSI    HSI selected as I2C1/I3C1clock
  *            @arg RCC_I2C1_I3C1CLKSOURCE_CSI    CSI selected as I2C1/I3C1clock
  */
#define __HAL_RCC_I2C1_I3C1_CONFIG(__I2C1_I3C1_CLKSOURCE__) \
  MODIFY_REG(RCC->CCIPR2, RCC_CCIPR2_I2C1_I3C1SEL, (uint32_t)(__I2C1_I3C1_CLKSOURCE__))

/** @brief  Macro to get the I2C1/I3C1clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_I2C1_I3C1CLKSOURCE_PCLK1  APB1 selected as I2C1/I3C1clock
  *            @arg RCC_I2C1_I3C1CLKSOURCE_PLL3R  PLL3_R selected as I2C1/I3C1clock
  *            @arg RCC_I2C1_I3C1CLKSOURCE_HSI    HSI selected as I2C1/I3C1clock
  *            @arg RCC_I2C1_I3C1CLKSOURCE_CSI    CSI selected as I2C1/I3C1clock
  */
#define __HAL_RCC_GET_I2C1_I3C1_SOURCE() ((uint32_t)(READ_BIT(RCC->CCIPR2, RCC_CCIPR2_I2C1_I3C1SEL)))

/** @brief  Macro to configure the I2C2/I2C3 clock source.
  * @param  __I2C23_CLKSOURCE__ specifies the I2C2/I2C3 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_I2C23CLKSOURCE_PCLK1  APB1 selected as I2C2/I2C3 clock
  *            @arg RCC_I2C23CLKSOURCE_PLL3R  PLL3_R selected as I2C2/I2C3 clock
  *            @arg RCC_I2C23CLKSOURCE_HSI    HSI selected as I2C2/I2C3 clock
  *            @arg RCC_I2C23CLKSOURCE_CSI    CSI selected as I2C2/I2C3 clock
  */
#define __HAL_RCC_I2C23_CONFIG(__I2C23_CLKSOURCE__) \
  MODIFY_REG(RCC->CCIPR2, RCC_CCIPR2_I2C23SEL, (uint32_t)(__I2C23_CLKSOURCE__))

/** @brief  Macro to get the I2C2/I2C3 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_I2C23CLKSOURCE_PCLK1  APB1 selected as I2C2/I2C3 clock
  *            @arg RCC_I2C23CLKSOURCE_PLL3R  PLL3_R selected as I2C2/I2C3 clock
  *            @arg RCC_I2C23CLKSOURCE_HSI    HSI selected as I2C2/I2C3 clock
  *            @arg RCC_I2C23CLKSOURCE_CSI    CSI selected as I2C2/I2C3 clock
  */
#define __HAL_RCC_GET_I2C23_SOURCE() ((uint32_t)(READ_BIT(RCC->CCIPR2, RCC_CCIPR2_I2C23SEL)))

/** @brief  Macro to configure the I3C1 clock source.
  * @param  __I3C1_CLKSOURCE__ specifies the I3C1 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_I3C1CLKSOURCE_PCLK1  APB1 selected as I3C1 clock
  *            @arg RCC_I3C1CLKSOURCE_PLL3R  PLL3_R selected as I3C1 clock
  *            @arg RCC_I3C1CLKSOURCE_HSI    HSI selected as I3C1 clock
  *            @arg RCC_I3C1CLKSOURCE_CSI    CSI selected as I3C1 clock
  */
#define __HAL_RCC_I3C1_CONFIG(__I3C1_CLKSOURCE__) \
  MODIFY_REG(RCC->CCIPR2, RCC_CCIPR2_I2C1_I3C1SEL, (uint32_t)(__I3C1_CLKSOURCE__))

/** @brief  Macro to get the I3C1 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_I3C1CLKSOURCE_PCLK1  APB1 selected as I3C1 clock
  *            @arg RCC_I3C1CLKSOURCE_PLL3R  PLL3_R selected as I3C1 clock
  *            @arg RCC_I3C1CLKSOURCE_HSI    HSI selected as I3C1 clock
  *            @arg RCC_I3C1CLKSOURCE_CSI    CSI selected as I3C1 clock
  */
#define __HAL_RCC_GET_I3C1_SOURCE() ((uint32_t)(READ_BIT(RCC->CCIPR2, RCC_CCIPR2_I2C1_I3C1SEL)))

/** @brief  Macro to configure the LPTIM1 clock source.
  * @param  __LPTIM1_CLKSOURCE__ specifies the LPTIM1 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_LPTIM1CLKSOURCE_PCLK1  APB1 clock selected as LPTIM1 clock
  *            @arg RCC_LPTIM1CLKSOURCE_PLL2P  PLL2_P selected as LPTIM1 clock
  *            @arg RCC_LPTIM1CLKSOURCE_PLL3R  PLL3_R selected as LPTIM1 clock
  *            @arg RCC_LPTIM1CLKSOURCE_LSE    LSE selected as LPTIM1 clock
  *            @arg RCC_LPTIM1CLKSOURCE_LSI    LSI Clock selected as LPTIM1 clock
  *            @arg RCC_LPTIM1CLKSOURCE_CLKP   CLKP selected as LPTIM1 clock
  */
#define __HAL_RCC_LPTIM1_CONFIG(__LPTIM1_CLKSOURCE__) \
  MODIFY_REG(RCC->CCIPR2, RCC_CCIPR2_LPTIM1SEL, (uint32_t)(__LPTIM1_CLKSOURCE__))

/** @brief  Macro to get the LPTIM1 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_LPTIM1CLKSOURCE_PCLK1  APB1 clock selected as LPTIM1 clock
  *            @arg RCC_LPTIM1CLKSOURCE_PLL2P  PLL2_P selected as LPTIM1 clock
  *            @arg RCC_LPTIM1CLKSOURCE_PLL3R  PLL3_R selected as LPTIM1 clock
  *            @arg RCC_LPTIM1CLKSOURCE_LSE    LSE selected as LPTIM1 clock
  *            @arg RCC_LPTIM1CLKSOURCE_LSI    LSI Clock selected as LPTIM1 clock
  *            @arg RCC_LPTIM1CLKSOURCE_CLKP   CLKP selected as LPTIM1 clock
  */
#define __HAL_RCC_GET_LPTIM1_SOURCE() ((uint32_t)(READ_BIT(RCC->CCIPR2, RCC_CCIPR2_LPTIM1SEL)))

/** @brief  Macro to configure the LPTIM2/LPTIM3 clock source.
  * @param  __LPTIM23_CLKSOURCE__ specifies the LPTIM2/LPTIM3 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_LPTIM23CLKSOURCE_PCLK4  APB4 clock selected as LPTIM2/LPTIM3 clock
  *            @arg RCC_LPTIM23CLKSOURCE_PLL2P  PLL2_P selected as LPTIM2/LPTIM3 clock
  *            @arg RCC_LPTIM23CLKSOURCE_PLL3R  PLL3_R selected as LPTIM2/LPTIM3 clock
  *            @arg RCC_LPTIM23CLKSOURCE_LSE    LSE selected as LPTIM2/LPTIM3 clock
  *            @arg RCC_LPTIM23CLKSOURCE_LSI    LSI Clock selected as LPTIM2/LPTIM3 clock
  *            @arg RCC_LPTIM23CLKSOURCE_CLKP   CLKP selected as LPTIM2/LPTIM3 clock
  */
#define __HAL_RCC_LPTIM23_CONFIG(__LPTIM23_CLKSOURCE__) \
  MODIFY_REG(RCC->CCIPR4, RCC_CCIPR4_LPTIM23SEL, (uint32_t)(__LPTIM23_CLKSOURCE__))

/** @brief  Macro to get the LPTIM2/LPTIM3 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_LPTIM23CLKSOURCE_PCLK4  APB4 clock selected as LPTIM2/LPTIM3 clock
  *            @arg RCC_LPTIM23CLKSOURCE_PLL2P  PLL2_P selected as LPTIM2/LPTIM3 clock
  *            @arg RCC_LPTIM23CLKSOURCE_PLL3R  PLL3_R selected as LPTIM2/LPTIM3 clock
  *            @arg RCC_LPTIM23CLKSOURCE_LSE    LSE selected as LPTIM2/LPTIM3 clock
  *            @arg RCC_LPTIM23CLKSOURCE_LSI    LSI Clock selected as LPTIM2/LPTIM3 clock
  *            @arg RCC_LPTIM23CLKSOURCE_CLKP   CLKP selected as LPTIM2/LPTIM3 clock
  */
#define __HAL_RCC_GET_LPTIM23_SOURCE() ((uint32_t)(READ_BIT(RCC->CCIPR4, RCC_CCIPR4_LPTIM23SEL)))

