RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal_rcc_ex.h
/** @brief  Macro to configure the LPTIM4/LPTIM5 clock source.
  * @param  __LPTIM45_CLKSOURCE__ specifies the LPTIM4/LPTIM5 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_LPTIM45CLKSOURCE_PCLK4  APB4 clock selected as LPTIM4/LPTIM5 clock
  *            @arg RCC_LPTIM45CLKSOURCE_PLL2P  PLL2_P selected as LPTIM4/LPTIM5 clock
  *            @arg RCC_LPTIM45CLKSOURCE_PLL3R  PLL3_R selected as LPTIM4/LPTIM5 clock
  *            @arg RCC_LPTIM45CLKSOURCE_LSE    LSE selected as LPTIM4/LPTIM5 clock
  *            @arg RCC_LPTIM45CLKSOURCE_LSI    LSI Clock selected as LPTIM4/LPTIM5 clock
  *            @arg RCC_LPTIM45CLKSOURCE_CLKP   CLKP selected as LPTIM4/LPTIM5 clock
  */
#define __HAL_RCC_LPTIM45_CONFIG(__LPTIM45_CLKSOURCE__) \
  MODIFY_REG(RCC->CCIPR4, RCC_CCIPR4_LPTIM45SEL, (uint32_t)(__LPTIM45_CLKSOURCE__))

/** @brief  Macro to get the LPTIM4/LPTIM5 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_LPTIM45CLKSOURCE_PCLK4  APB4 clock selected as LPTIM4/LPTIM5 clock
  *            @arg RCC_LPTIM45CLKSOURCE_PLL2P  PLL2_P selected as LPTIM4/LPTIM5 clock
  *            @arg RCC_LPTIM45CLKSOURCE_PLL3R  PLL3_R selected as LPTIM4/LPTIM5 clock
  *            @arg RCC_LPTIM45CLKSOURCE_LSE    LSE selected as LPTIM4/LPTIM5 clock
  *            @arg RCC_LPTIM45CLKSOURCE_LSI    LSI Clock selected as LPTIM4/LPTIM5 clock
  *            @arg RCC_LPTIM45CLKSOURCE_CLKP   CLKP selected as LPTIM4/LPTIM5 clock
  */
#define __HAL_RCC_GET_LPTIM45_SOURCE() ((uint32_t)(READ_BIT(RCC->CCIPR4, RCC_CCIPR4_LPTIM45SEL)))

/** @brief  Macro to configure the LPUART1 clock (LPUART1CLK).
  * @param  __LPUART1_CLKSOURCE__ specifies the LPUART1 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_LPUART1CLKSOURCE_PCLK4  APB4 Clock selected as LPUART1 clock
  *            @arg RCC_LPUART1CLKSOURCE_PLL2Q  PLL2_Q Clock selected as LPUART1 clock
  *            @arg RCC_LPUART1CLKSOURCE_PLL3Q  PLL3_Q Clock selected as LPUART1 clock
  *            @arg RCC_LPUART1CLKSOURCE_HSI    HSI selected as LPUART1 clock
  *            @arg RCC_LPUART1CLKSOURCE_CSI    CSI Clock selected as LPUART1 clock
  *            @arg RCC_LPUART1CLKSOURCE_LSE    LSE selected as LPUART1 clock
  */
#define __HAL_RCC_LPUART1_CONFIG(__LPUART1_CLKSOURCE__) \
  MODIFY_REG(RCC->CCIPR4, RCC_CCIPR4_LPUART1SEL, (uint32_t)(__LPUART1_CLKSOURCE__))

/** @brief  Macro to get the LPUART1 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_LPUART1CLKSOURCE_PCLK4  APB4 Clock selected as LPUART1 clock
  *            @arg RCC_LPUART1CLKSOURCE_PLL2Q  PLL2_Q Clock selected as LPUART1 clock
  *            @arg RCC_LPUART1CLKSOURCE_PLL3Q  PLL3_Q Clock selected as LPUART1 clock
  *            @arg RCC_LPUART1CLKSOURCE_HSI    HSI selected as LPUART1 clock
  *            @arg RCC_LPUART1CLKSOURCE_CSI    CSI Clock selected as LPUART1 clock
  *            @arg RCC_LPUART1CLKSOURCE_LSE    LSE selected as LPUART1 clock
  */
#define __HAL_RCC_GET_LPUART1_SOURCE() ((uint32_t)(READ_BIT(RCC->CCIPR4, RCC_CCIPR4_LPUART1SEL)))

/** @brief  Macro to get the LTDC clock source.
  * @retval The clock source is internally connected to:
  *            @arg RCC_LTDCCLKSOURCE_PLL3R     PLL3_R Clock selected as LTDC clock
  */
#define __HAL_RCC_GET_LTDC_SOURCE() RCC_LTDCCLKSOURCE_PLL3R

/** @brief  Macro to configure the XSPI1 clock source.
  *
  * @param  __XSPI1_CLKSOURCE__ specifies the XSPI1 clock source.
  *            @arg RCC_XSPI1CLKSOURCE_HCLK  HCLK Clock selected as XSPI1 clock
  *            @arg RCC_XSPI1CLKSOURCE_PLL2S PLL2_S Clock selected as XSPI1 clock
  *            @arg RCC_XSPI1CLKSOURCE_PLL2T PLL2_T Clock selected as XSPI1 clock
  */
#define __HAL_RCC_XSPI1_CONFIG(__XSPI1_CLKSOURCE__) \
  MODIFY_REG(RCC->CCIPR1, RCC_CCIPR1_XSPI1SEL, (uint32_t)(__XSPI1_CLKSOURCE__))

/** @brief  Macro to get the XSPI1 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_XSPI1CLKSOURCE_HCLK  HCLK Clock selected as XSPI1 clock
  *            @arg RCC_XSPI1CLKSOURCE_PLL2S PLL2_S Clock selected as XSPI1 clock
  *            @arg RCC_XSPI1CLKSOURCE_PLL2T PLL2_T Clock selected as XSPI1 clock
  *            @arg RCC_XSPI1CLKSOURCE_HCLK_DIV4 Recovery Clock selected as XSPI1 clock
  */
#define __HAL_RCC_GET_XSPI1_SOURCE() ((READ_BIT(RCC->CKPROTR, RCC_CKPROTR_XSPI1SWP) == RCC_XSPI1CLKSOURCE_HCLK_DIV4) ? \
                                      RCC_XSPI1CLKSOURCE_HCLK_DIV4 : ((uint32_t)(READ_BIT(RCC->CCIPR1, RCC_CCIPR1_XSPI1SEL))))

/** @brief  Macro to configure the XSPI2 clock source.
  *
  * @param  __XSPI2_CLKSOURCE__ specifies the XSPI2 clock source.
  *            @arg RCC_XSPI2CLKSOURCE_HCLK  HCLK Clock selected as XSPI2 clock
  *            @arg RCC_XSPI2CLKSOURCE_PLL2S PLL2_S Clock selected as XSPI2 clock
  *            @arg RCC_XSPI2CLKSOURCE_PLL2T PLL2_T Clock selected as XSPI2 clock
  */
#define __HAL_RCC_XSPI2_CONFIG(__XSPI2_CLKSOURCE__) \
  MODIFY_REG(RCC->CCIPR1, RCC_CCIPR1_XSPI2SEL, (uint32_t)(__XSPI2_CLKSOURCE__))

/** @brief  Macro to get the XSPI2 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_XSPI2CLKSOURCE_HCLK  HCLK Clock selected as XSPI2 clock
  *            @arg RCC_XSPI2CLKSOURCE_PLL2S PLL2_S Clock selected as XSPI2 clock
  *            @arg RCC_XSPI2CLKSOURCE_PLL2T PLL2_T Clock selected as XSPI2 clock
  *            @arg RCC_XSPI2CLKSOURCE_HCLK_DIV4 Recovery Clock selected as XSPI2 clock
  */
#define __HAL_RCC_GET_XSPI2_SOURCE() ((READ_BIT(RCC->CKPROTR, RCC_CKPROTR_XSPI2SWP) == RCC_XSPI2CLKSOURCE_HCLK_DIV4) ? \
                                      RCC_XSPI2CLKSOURCE_HCLK_DIV4 : ((uint32_t)(READ_BIT(RCC->CCIPR1, RCC_CCIPR1_XSPI2SEL))))

/**
  * @brief  Macro to configure the PSSI clock source.
  * @param  __PSSI_CLKSOURCE__ defines the PSSI clock source.
  *          This parameter can be one of the following values:
  *             @arg RCC_PSSICLKSOURCE_PLL3R  PLL3_R selected as PSSI clock
  *             @arg RCC_PSSICLKSOURCE_CLKP   Peripheral clock selected as PSSI clock
  * @retval None
  */
#define __HAL_RCC_PSSI_CONFIG(__PSSI_CLKSOURCE__) \
  MODIFY_REG(RCC->CCIPR1, RCC_CCIPR1_PSSISEL, (__PSSI_CLKSOURCE__))

