RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal_rcc_ex.h
/** @brief  Macro to get the PSSI clock source.
  * @retval The clock source can be one of the following values:
  *             @arg RCC_PSSICLKSOURCE_PLL3R  PLL3_R selected as PSSI clock
  *             @arg RCC_PSSICLKSOURCE_CLKP   Peripheral clock selected as PSSI clock
  */
#define __HAL_RCC_GET_PSSI_SOURCE() ((uint32_t)(READ_BIT(RCC->CCIPR1, RCC_CCIPR1_PSSISEL)))

/**
  * @brief  Macro to configure the SAI1 clock source.
  * @param  __SAI1_CLKSOURCE__ defines the SAI1 clock source.
  *          This parameter can be one of the following values:
  *             @arg RCC_SAI1CLKSOURCE_PLL1Q  PLL1_Q selected as SAI1 clock
  *             @arg RCC_SAI1CLKSOURCE_PLL2P  PLL2_P selected as SAI1 clock
  *             @arg RCC_SAI1CLKSOURCE_PLL3P  PLL3_P selected as SAI1 clock
  *             @arg RCC_SAI1CLKSOURCE_PIN    External I2S_CKIN selected as SAI1 clock
  *             @arg RCC_SAI1CLKSOURCE_CLKP   Peripheral clock selected as SAI1 clock
  * @retval None
  */
#define __HAL_RCC_SAI1_CONFIG(__SAI1_CLKSOURCE__) \
  MODIFY_REG(RCC->CCIPR3, RCC_CCIPR3_SAI1SEL, (__SAI1_CLKSOURCE__))

/** @brief  Macro to get the SAI1 clock source.
  * @retval The clock source can be one of the following values:
  *             @arg RCC_SAI1CLKSOURCE_PLL1Q  PLL1_Q selected as SAI1 clock
  *             @arg RCC_SAI1CLKSOURCE_PLL2P  PLL2_P selected as SAI1 clock
  *             @arg RCC_SAI1CLKSOURCE_PLL3P  PLL3_P selected as SAI1 clock
  *             @arg RCC_SAI1CLKSOURCE_PIN    External I2S_CKIN selected as SAI1 clock
  *             @arg RCC_SAI1CLKSOURCE_CLKP   Peripheral clock selected as SAI1 clock
  */
#define __HAL_RCC_GET_SAI1_SOURCE() ((uint32_t)(READ_BIT(RCC->CCIPR3, RCC_CCIPR3_SAI1SEL)))

/**
  * @brief  Macro to configure the SAI2 clock source.
  * @param  __SAI2_CLKSOURCE__ defines the SAI2 clock source.
  *          This parameter can be one of the following values:
  *             @arg RCC_SAI2CLKSOURCE_PLL1Q  PLL1_Q selected as SAI2 clock
  *             @arg RCC_SAI2CLKSOURCE_PLL2P  PLL2_P selected as SAI2 clock
  *             @arg RCC_SAI2CLKSOURCE_PLL3P  PLL3_P selected as SAI2 clock
  *             @arg RCC_SAI2CLKSOURCE_PIN    External I2S_CKIN selected as SAI2 clock
  *             @arg RCC_SAI2CLKSOURCE_CLKP   Peripheral clock selected as SAI2 clock
  *             @arg RCC_SAI2CLKSOURCE_SPDIF  SPDIF output clock selected as SAI2 clock
  * @retval None
  */
#define __HAL_RCC_SAI2_CONFIG(__SAI2_CLKSOURCE__) \
  MODIFY_REG(RCC->CCIPR3, RCC_CCIPR3_SAI2SEL, (__SAI2_CLKSOURCE__))

/** @brief  Macro to get the SAI2 clock source.
  * @retval The clock source can be one of the following values:
  *             @arg RCC_SAI2CLKSOURCE_PLL1Q  PLL1_Q selected as SAI2 clock
  *             @arg RCC_SAI2CLKSOURCE_PLL2P  PLL2_P selected as SAI2 clock
  *             @arg RCC_SAI2CLKSOURCE_PLL3P  PLL3_P selected as SAI2 clock
  *             @arg RCC_SAI2CLKSOURCE_PIN    External I2S_CKIN selected as SAI2 clock
  *             @arg RCC_SAI2CLKSOURCE_CLKP   Peripheral clock selected as SAI2 clock
  *             @arg RCC_SAI2CLKSOURCE_SPDIF  SPDIF output clock selected as SAI2 clock
  */
#define __HAL_RCC_GET_SAI2_SOURCE() ((uint32_t)(READ_BIT(RCC->CCIPR3, RCC_CCIPR3_SAI2SEL)))


/** @brief  Macro to configure the SDMMC kernel clock source.
  * @param  __SDMMC12_CLKSOURCE__ specifies  clock source  for SDMMC
  *        This parameter can be one of the following values:
  *            @arg RCC_SDMMC12CLKSOURCE_PLL2S  PLL2_S selected as SDMMC kernel clock
  *            @arg RCC_SDMMC12CLKSOURCE_PLL2T  PLL2_R selected as SDMMC kernel clock
  */
#define __HAL_RCC_SDMMC12_CONFIG(__SDMMC12_CLKSOURCE__) \
  MODIFY_REG(RCC->CCIPR1, RCC_CCIPR1_SDMMC12SEL, (uint32_t)(__SDMMC12_CLKSOURCE__))

/** @brief  Macro to get the SDMMC kernel clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_SDMMC12CLKSOURCE_PLL2S  PLL2_S selected as SDMMC12 kernel clock
  *            @arg RCC_SDMMC12CLKSOURCE_PLL2T  PLL2_R selected as SDMMC12 kernel clock
  */
#define __HAL_RCC_GET_SDMMC12_SOURCE() ((uint32_t)(READ_BIT(RCC->CCIPR1, RCC_CCIPR1_SDMMC12SEL)))

/**
  * @brief  Macro to Configure the SPDIFRX clock source.
  * @param  __SPDIFRX_CLKSOURCE__ defines the SPDIFRX clock source.
  *          This parameter can be one of the following values:
  *             @arg RCC_SPDIFRXCLKSOURCE_PLL1Q  PLL1_Q selected as SPDIFRX clock
  *             @arg RCC_SPDIFRXCLKSOURCE_PLL2R  PLL2_R selected as SPDIFRX clock
  *             @arg RCC_SPDIFRXCLKSOURCE_PLL3R  PLL3_R selected as SPDIFRX clock
  *             @arg RCC_SPDIFRXCLKSOURCE_HSI    HSI selected as SPDIFRX clock
  * @retval None
  */
#define __HAL_RCC_SPDIFRX_CONFIG(__SPDIFRX_CLKSOURCE__ ) \
  MODIFY_REG(RCC->CCIPR2, RCC_CCIPR2_SPDIFRXSEL, (__SPDIFRX_CLKSOURCE__))

/**
  * @brief  Macro to get the SPDIFRX clock source.
  * @retval The clock source can be one of the following values:
  *             @arg RCC_SPDIFRXCLKSOURCE_PLL1Q  PLL1_Q selected as SPDIFRX clock
  *             @arg RCC_SPDIFRXCLKSOURCE_PLL2R  PLL2_R selected as SPDIFRX clock
  *             @arg RCC_SPDIFRXCLKSOURCE_PLL3R  PLL3_R selected as SPDIFRX clock
  *             @arg RCC_SPDIFRXCLKSOURCE_HSI    HSI selected as SPDIFRX clock
  * @retval None
  */
#define __HAL_RCC_GET_SPDIFRX_SOURCE() ((uint32_t)(READ_BIT(RCC->CCIPR2, RCC_CCIPR2_SPDIFRXSEL)))

/**
  * @brief  Macro to configure the SPI1 clock source.
  * @param  __SPI1_CLKSOURCE__ defines the SPI1 clock source.
  *         This parameter can be one of the following values:
  *             @arg RCC_SPI1CLKSOURCE_PLL1Q  PLL1_Q selected as SPI1 clock
  *             @arg RCC_SPI1CLKSOURCE_PLL2P  PLL2_P selected as SPI1 clock
  *             @arg RCC_SPI1CLKSOURCE_PLL3P  PLL3_P selected as SPI1 clock
  *             @arg RCC_SPI1CLKSOURCE_PIN    External I2S_CKIN selected as SPI1 clock
  *             @arg RCC_SPI1CLKSOURCE_CLKP   Peripheral clock selected as SPI1 clock
  * @retval None
  */
#define __HAL_RCC_SPI1_CONFIG(__SPI1_CLKSOURCE__ ) \
  MODIFY_REG(RCC->CCIPR3, RCC_CCIPR3_SPI1SEL, (__SPI1_CLKSOURCE__))

/** @brief  Macro to get the SPI1 clock source.
  * @retval The clock source can be one of the following values:
  *             @arg RCC_SPI1CLKSOURCE_PLL1Q  PLL1_Q selected as SPI1 clock
  *             @arg RCC_SPI1CLKSOURCE_PLL2P  PLL2_P selected as SPI1 clock
  *             @arg RCC_SPI1CLKSOURCE_PLL3P  PLL3_P selected as SPI1 clock
  *             @arg RCC_SPI1CLKSOURCE_PIN    External I2S_CKIN selected as SPI1 clock
  *             @arg RCC_SPI1CLKSOURCE_CLKP   Peripheral clock selected as SPI1 clock
  */
#define __HAL_RCC_GET_SPI1_SOURCE() ((uint32_t)(READ_BIT(RCC->CCIPR3, RCC_CCIPR3_SPI1SEL)))

/**
  * @brief  Macro to configure the SPI2/SPI3 clock source.
  * @param  __SPI23_CLKSOURCE__ defines the SPI2/SPI3 clock source.
  *         This parameter can be one of the following values:
  *             @arg RCC_SPI23CLKSOURCE_PLL1Q  PLL1_Q selected as SPI2/SPI3 clock
  *             @arg RCC_SPI23CLKSOURCE_PLL2P  PLL2_P selected as SPI2/SPI3 clock
  *             @arg RCC_SPI23CLKSOURCE_PLL3P  PLL3_P selected as SPI2/SPI3 clock
  *             @arg RCC_SPI23CLKSOURCE_PIN    External I2S_CKIN selected as SPI2/SPI3 clock
  *             @arg RCC_SPI23CLKSOURCE_CLKP   Peripheral clock selected as SPI2/SPI3 clock
  * @retval None
  */
#define __HAL_RCC_SPI23_CONFIG(__SPI23_CLKSOURCE__ ) \
  MODIFY_REG(RCC->CCIPR2, RCC_CCIPR2_SPI23SEL, (__SPI23_CLKSOURCE__))

/** @brief  Macro to get the SPI2/SPI3 clock source.
  * @retval The clock source can be one of the following values:
  *             @arg RCC_SPI23CLKSOURCE_PLL1Q  PLL1_Q selected as SPI2/SPI3 clock
  *             @arg RCC_SPI23CLKSOURCE_PLL2P  PLL2_P selected as SPI2/SPI3 clock
  *             @arg RCC_SPI23CLKSOURCE_PLL3P  PLL3_P selected as SPI2/SPI3 clock
  *             @arg RCC_SPI23CLKSOURCE_PIN    External I2S_CKIN selected as SPI2/SPI3 clock
  *             @arg RCC_SPI23CLKSOURCE_CLKP   Peripheral clock selected as SPI2/SPI3 clock
  */
#define __HAL_RCC_GET_SPI23_SOURCE() ((uint32_t)(READ_BIT(RCC->CCIPR2, RCC_CCIPR2_SPI23SEL)))

/**
  * @brief  Macro to configure the SPI4/SPI5 clock source.
  * @param  __SPI45_CLKSOURCE__ defines the SPI4/SPI5 clock source.
  *         This parameter can be one of the following values:
  *             @arg RCC_SPI45CLKSOURCE_PCLK2  APB2 Clock selected as SPI4/SPI5 clock
  *             @arg RCC_SPI45CLKSOURCE_PLL2Q  PLL2_Q selected as SPI4/SPI5 clock
  *             @arg RCC_SPI45CLKSOURCE_PLL3Q  PLL3_Q selected as SPI4/SPI5 clock
  *             @arg RCC_SPI45CLKSOURCE_HSI    HSI selected as SPI4/SPI5 clock
  *             @arg RCC_SPI45CLKSOURCE_CSI    CSI selected as SPI4/SPI5 clock
  *             @arg RCC_SPI45CLKSOURCE_HSE    HSE selected as SPI4/SPI5 clock
  * @retval None
  */
#define __HAL_RCC_SPI45_CONFIG(__SPI45_CLKSOURCE__ ) \
  MODIFY_REG(RCC->CCIPR3, RCC_CCIPR3_SPI45SEL, (__SPI45_CLKSOURCE__))

