RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal_rcc_ex.h
/** @brief  Macro to get the SPI4/SPI5 clock source.
  * @retval The clock source can be one of the following values:
  *             @arg RCC_SPI45CLKSOURCE_PCLK2  APB2 Clock selected as SPI4/SPI5 clock
  *             @arg RCC_SPI45CLKSOURCE_PLL2Q  PLL2_Q selected as SPI4/SPI5 clock
  *             @arg RCC_SPI45CLKSOURCE_PLL3Q  PLL3_Q selected as SPI4/SPI5 clock
  *             @arg RCC_SPI45CLKSOURCE_HSI    HSI selected as SPI4/SPI5 clock
  *             @arg RCC_SPI45CLKSOURCE_CSI    CSI selected as SPI4/SPI5 clock
  *             @arg RCC_SPI45CLKSOURCE_HSE    HSE selected as SPI4/SPI5 clock
  */
#define __HAL_RCC_GET_SPI45_SOURCE() ((uint32_t)(READ_BIT(RCC->CCIPR3, RCC_CCIPR3_SPI45SEL)))

/**
  * @brief  Macro to configure the SPI6 clock source.
  * @param  __SPI6_CLKSOURCE__ defines the SPI6 clock source.
  *         This parameter can be one of the following values:
  *            @arg RCC_SPI6CLKSOURCE_PCLK4  APB4 Clock selected as SPI6 clock
  *            @arg RCC_SPI6CLKSOURCE_PLL2Q  PLL2_Q selected as SPI6 clock
  *            @arg RCC_SPI6CLKSOURCE_PLL3Q  PLL3_Q selected as SPI6 clock
  *            @arg RCC_SPI6CLKSOURCE_HSI    HSI selected as SPI6 clock
  *            @arg RCC_SPI6CLKSOURCE_CSI    CSI selected as SPI6 clock
  *            @arg RCC_SPI6CLKSOURCE_HSE    HSE selected as SPI6 clock
  * @retval None
  */
#define __HAL_RCC_SPI6_CONFIG(__SPI6_CLKSOURCE__ ) \
  MODIFY_REG(RCC->CCIPR4, RCC_CCIPR4_SPI6SEL, (__SPI6_CLKSOURCE__))

/** @brief  Macro to get the SPI6 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_SPI6CLKSOURCE_PCLK4  APB4 Clock selected as SPI6 clock
  *            @arg RCC_SPI6CLKSOURCE_PLL2Q  PLL2_Q selected as SPI6 clock
  *            @arg RCC_SPI6CLKSOURCE_PLL3Q  PLL3_Q selected as SPI6 clock
  *            @arg RCC_SPI6CLKSOURCE_HSI    HSI selected as SPI6 clock
  *            @arg RCC_SPI6CLKSOURCE_CSI    CSI selected as SPI6 clock
  *            @arg RCC_SPI6CLKSOURCE_HSE    HSE selected as SPI6 clock
  */
#define __HAL_RCC_GET_SPI6_SOURCE() ((uint32_t)(READ_BIT(RCC->CCIPR4, RCC_CCIPR4_SPI6SEL)))

/** @brief  Macro to configure the USART1 clock source.
  * @param  __USART1_CLKSOURCE__ specifies the USART1 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_USART1CLKSOURCE_PCLK2  APB2 Clock selected as USART1 clock
  *            @arg RCC_USART1CLKSOURCE_PLL2Q  PLL2_Q selected as USART1 clock
  *            @arg RCC_USART1CLKSOURCE_PLL3Q  PLL3_Q selected as USART1 clock
  *            @arg RCC_USART1CLKSOURCE_HSI    HSI selected as USART1 clock
  *            @arg RCC_USART1CLKSOURCE_CSI    CSI selected as USART1 clock
  *            @arg RCC_USART1CLKSOURCE_LSE    LSE selected as USART1 clock
  */
#define __HAL_RCC_USART1_CONFIG(__USART1_CLKSOURCE__) \
  MODIFY_REG(RCC->CCIPR3, RCC_CCIPR3_USART1SEL, (uint32_t)(__USART1_CLKSOURCE__))

/** @brief  Macro to get the USART1/6/9* /10* clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_USART1CLKSOURCE_PCLK2  APB2 Clock selected as USART1 clock
  *            @arg RCC_USART1CLKSOURCE_PLL2Q  PLL2_Q selected as USART1 clock
  *            @arg RCC_USART1CLKSOURCE_PLL3Q  PLL3_Q selected as USART1 clock
  *            @arg RCC_USART1CLKSOURCE_HSI    HSI selected as USART1 clock
  *            @arg RCC_USART1CLKSOURCE_CSI    CSI selected as USART1 clock
  *            @arg RCC_USART1CLKSOURCE_LSE    LSE selected as USART1 clock
  */
#define __HAL_RCC_GET_USART1_SOURCE() ((uint32_t)(READ_BIT(RCC->CCIPR3, RCC_CCIPR3_USART1SEL)))

/** @brief  Macro to configure the USART2/USART3/UART4/UART5/UART7/UART8 clock source.
  * @param  __USART234578_CLKSOURCE__ specifies the USART2/UART3/UART4/UART5/UART7/UART8 clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_USART234578CLKSOURCE_PCLK1  APB1 Clock selected as USART2/USART3/UART4/UART5/UART7/UART8 clock
  *            @arg RCC_USART234578CLKSOURCE_PLL2Q  PLL2_Q Clock selected as USART2/USART3/UART4/UART5/UART7/UART8 clock
  *            @arg RCC_USART234578CLKSOURCE_PLL3Q  PLL3_Q Clock selected as USART2/USART3/UART4/UART5/UART7/UART8 clock
  *            @arg RCC_USART234578CLKSOURCE_HSI    HSI selected as USART2/USART3/UART4/UART5/UART7/UART8 clock
  *            @arg RCC_USART234578CLKSOURCE_CSI    CSI Clock selected as USART2/USART3/UART4/UART5/UART7/UART8 clock
  *            @arg RCC_USART234578CLKSOURCE_LSE    LSE selected as USART2/USART3/UART4/UART5/UART7/UART8 clock
  */
#define __HAL_RCC_USART234578_CONFIG(__USART234578_CLKSOURCE__) \
  MODIFY_REG(RCC->CCIPR2, RCC_CCIPR2_UART234578SEL, (uint32_t)(__USART234578_CLKSOURCE__))

/** @brief  Macro to get the USART2/USART3/UART4/UART5/UART7/UART8 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg RCC_USART234578CLKSOURCE_PCLK1  APB1 Clock selected as USART2/USART3/UART4/UART5/UART7/UART8 clock
  *            @arg RCC_USART234578CLKSOURCE_PLL2Q  PLL2_Q Clock selected as USART2/USART3/UART4/UART5/UART7/UART8 clock
  *            @arg RCC_USART234578CLKSOURCE_PLL3Q  PLL3_Q Clock selected as USART2/USART3/UART4/UART5/UART7/UART8 clock
  *            @arg RCC_USART234578CLKSOURCE_HSI    HSI selected as USART2/USART3/UART4/UART5/UART7/UART8 clock
  *            @arg RCC_USART234578CLKSOURCE_CSI    CSI Clock selected as USART2/USART3/UART4/UART5/UART7/UART8 clock
  *            @arg RCC_USART234578CLKSOURCE_LSE    LSE selected as USART2/USART3/UART4/UART5/UART7/UART8 clock
  */
#define __HAL_RCC_GET_USART234578_SOURCE() ((uint32_t)(READ_BIT(RCC->CCIPR2, RCC_CCIPR2_UART234578SEL)))

/** @brief  Macro to configure the Timers clocks prescalers
  * @param  __PRESC__  specifies the Timers clocks prescalers selection
  *         This parameter can be one of the following values:
  *            @arg RCC_TIMPRES_DISABLE
  *                 The timers kernel clock is equal to:
  *                   - PCLKx_freq, if PCLKx = RCC_APBx_DIV1
  *                   - 2*PCLKx_freq, otherwise (default after reset)
  *            @arg RCC_TIMPRES_ENABLE
  *                 The timers kernel clock is equal to:
  *                   - PCLKx_freq, if PCLKx = RCC_APBx_DIV1
  *                   - 2*PCLKx_freq, if PCLKx = RCC_APBx_DIV2
  *                   - 4*PCLKx_freq, otherwise
  */
#define __HAL_RCC_TIMCLKPRESCALER_CONFIG(__PRESC__) \
  MODIFY_REG(RCC->CFGR, RCC_CFGR_TIMPRE, (uint32_t)(__PRESC__))

/** @brief  Macro to get the Timers clocks prescalers
  * @retval The parameter can be one of the following values:
  *            @arg RCC_TIMPRES_DISABLE
  *                 The timers kernel clock is equal to:
  *                   - PCLKx_freq, if PCLKx = RCC_APBx_DIV1
  *                   - 2*PCLKx_freq, otherwise (default after reset)
  *            @arg RCC_TIMPRES_ENABLE
  *                 The timers kernel clock is equal to:
  *                   - PCLKx_freq, if PCLKx = RCC_APBx_DIV1
  *                   - 2*PCLKx_freq, if PCLKx = RCC_APBx_DIV2
  *                   - 4*PCLKx_freq, otherwise
  */
#define __HAL_RCC_GET_TIMCLKPRESCALER() ((uint32_t)(READ_BIT(RCC->CFGR, RCC_CFGR_TIMPRE)))

