RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal_rcc_ex.h
/* Private macros ------------------------------------------------------------*/
/** @addtogroup RCCEx_Private_Macros
  * @{
  */

/** @defgroup RCCEx_IS_RCC_Definitions Private macros to check input parameters
  * @{
  */

#define IS_RCC_PERIPHCLOCK(__SELECTION__)  \
  ((((__SELECTION__) & RCC_PERIPHCLK_FMC)         == RCC_PERIPHCLK_FMC)         || \
   (((__SELECTION__) & RCC_PERIPHCLK_XSPI1)       == RCC_PERIPHCLK_XSPI1)       || \
   (((__SELECTION__) & RCC_PERIPHCLK_XSPI2)       == RCC_PERIPHCLK_XSPI2)       || \
   (((__SELECTION__) & RCC_PERIPHCLK_CKPER)       == RCC_PERIPHCLK_CKPER)       || \
   (((__SELECTION__) & RCC_PERIPHCLK_ADC)         == RCC_PERIPHCLK_ADC)         || \
   (((__SELECTION__) & RCC_PERIPHCLK_ADF1)        == RCC_PERIPHCLK_ADF1)        || \
   (((__SELECTION__) & RCC_PERIPHCLK_CEC)         == RCC_PERIPHCLK_CEC)         || \
   (((__SELECTION__) & RCC_PERIPHCLK_ETH1REF)     == RCC_PERIPHCLK_ETH1REF)     || \
   (((__SELECTION__) & RCC_PERIPHCLK_ETH1PHY)     == RCC_PERIPHCLK_ETH1PHY)     || \
   (((__SELECTION__) & RCC_PERIPHCLK_FDCAN)       == RCC_PERIPHCLK_FDCAN)       || \
   (((__SELECTION__) & RCC_PERIPHCLK_I2C1_I3C1)   == RCC_PERIPHCLK_I2C1_I3C1)   || \
   (((__SELECTION__) & RCC_PERIPHCLK_I2C23)       == RCC_PERIPHCLK_I2C23)       || \
   (((__SELECTION__) & RCC_PERIPHCLK_LPTIM1)      == RCC_PERIPHCLK_LPTIM1)      || \
   (((__SELECTION__) & RCC_PERIPHCLK_LPTIM23)     == RCC_PERIPHCLK_LPTIM23)     || \
   (((__SELECTION__) & RCC_PERIPHCLK_LPTIM45)     == RCC_PERIPHCLK_LPTIM45)     || \
   (((__SELECTION__) & RCC_PERIPHCLK_LPUART1)     == RCC_PERIPHCLK_LPUART1)     || \
   (((__SELECTION__) & RCC_PERIPHCLK_LTDC)        == RCC_PERIPHCLK_LTDC)        || \
   (((__SELECTION__) & RCC_PERIPHCLK_PSSI)        == RCC_PERIPHCLK_PSSI)        || \
   (((__SELECTION__) & RCC_PERIPHCLK_RTC)         == RCC_PERIPHCLK_RTC)         || \
   (((__SELECTION__) & RCC_PERIPHCLK_SAI1)        == RCC_PERIPHCLK_SAI1)        || \
   (((__SELECTION__) & RCC_PERIPHCLK_SAI2)        == RCC_PERIPHCLK_SAI2)        || \
   (((__SELECTION__) & RCC_PERIPHCLK_SDMMC12)     == RCC_PERIPHCLK_SDMMC12)     || \
   (((__SELECTION__) & RCC_PERIPHCLK_SPDIFRX)     == RCC_PERIPHCLK_SPDIFRX)     || \
   (((__SELECTION__) & RCC_PERIPHCLK_SPI1)        == RCC_PERIPHCLK_SPI1)        || \
   (((__SELECTION__) & RCC_PERIPHCLK_SPI23)       == RCC_PERIPHCLK_SPI23)       || \
   (((__SELECTION__) & RCC_PERIPHCLK_SPI45)       == RCC_PERIPHCLK_SPI45)       || \
   (((__SELECTION__) & RCC_PERIPHCLK_SPI6)        == RCC_PERIPHCLK_SPI6)        || \
   (((__SELECTION__) & RCC_PERIPHCLK_TIM)         == RCC_PERIPHCLK_TIM)         || \
   (((__SELECTION__) & RCC_PERIPHCLK_USART1)      == RCC_PERIPHCLK_USART1)      || \
   (((__SELECTION__) & RCC_PERIPHCLK_USART234578) == RCC_PERIPHCLK_USART234578) || \
   (((__SELECTION__) & RCC_PERIPHCLK_USBPHYC)     == RCC_PERIPHCLK_USBPHYC)     || \
   (((__SELECTION__) & RCC_PERIPHCLK_USBOTGFS)    == RCC_PERIPHCLK_USBOTGFS))

#define IS_RCC_ADCCLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_ADCCLKSOURCE_PLL2P) || \
   ((__SOURCE__) == RCC_ADCCLKSOURCE_PLL3R) || \
   ((__SOURCE__) == RCC_ADCCLKSOURCE_CLKP))

#define IS_RCC_ADF1CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_ADF1CLKSOURCE_HCLK)  || \
   ((__SOURCE__) == RCC_ADF1CLKSOURCE_PLL2P) || \
   ((__SOURCE__) == RCC_ADF1CLKSOURCE_PLL3P) || \
   ((__SOURCE__) == RCC_ADF1CLKSOURCE_PIN)   || \
   ((__SOURCE__) == RCC_ADF1CLKSOURCE_CSI)   || \
   ((__SOURCE__) == RCC_ADF1CLKSOURCE_HSI))

#define IS_RCC_CECCLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_CECCLKSOURCE_LSE) || \
   ((__SOURCE__) == RCC_CECCLKSOURCE_LSI) || \
   ((__SOURCE__) == RCC_CECCLKSOURCE_CSI))

#define IS_RCC_CKPERCLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_CLKPSOURCE_HSI) || \
   ((__SOURCE__) == RCC_CLKPSOURCE_CSI) || \
   ((__SOURCE__) == RCC_CLKPSOURCE_HSE))

#define IS_RCC_ETH1REFCLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_ETH1REFCLKSOURCE_PHY) || \
   ((__SOURCE__) == RCC_ETH1REFCLKSOURCE_HSE) || \
   ((__SOURCE__) == RCC_ETH1REFCLKSOURCE_ETH))

#define IS_RCC_ETH1PHYCLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_ETH1PHYCLKSOURCE_HSE) || \
   ((__SOURCE__) == RCC_ETH1PHYCLKSOURCE_PLL3S))

#define IS_RCC_FDCANCLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_FDCANCLKSOURCE_HSE)   || \
   ((__SOURCE__) == RCC_FDCANCLKSOURCE_PLL1Q) || \
   ((__SOURCE__) == RCC_FDCANCLKSOURCE_PLL2P))

#define IS_RCC_FMCCLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_FMCCLKSOURCE_HCLK)  || \
   ((__SOURCE__) == RCC_FMCCLKSOURCE_PLL1Q) || \
   ((__SOURCE__) == RCC_FMCCLKSOURCE_PLL2R) || \
   ((__SOURCE__) == RCC_FMCCLKSOURCE_HSI))

#define IS_RCC_I2C1_I3C1CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_I2C1_I3C1CLKSOURCE_PCLK1) || \
   ((__SOURCE__) == RCC_I2C1_I3C1CLKSOURCE_PLL3R) || \
   ((__SOURCE__) == RCC_I2C1_I3C1CLKSOURCE_HSI)   || \
   ((__SOURCE__) == RCC_I2C1_I3C1CLKSOURCE_CSI))

#define IS_RCC_I2C23CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_I2C23CLKSOURCE_PCLK1) || \
   ((__SOURCE__) == RCC_I2C23CLKSOURCE_PLL3R) || \
   ((__SOURCE__) == RCC_I2C23CLKSOURCE_HSI)   || \
   ((__SOURCE__) == RCC_I2C23CLKSOURCE_CSI))

#define IS_RCC_I3C1CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_I3C1CLKSOURCE_PCLK1) || \
   ((__SOURCE__) == RCC_I3C1CLKSOURCE_PLL3R) || \
   ((__SOURCE__) == RCC_I3C1CLKSOURCE_HSI)   || \
   ((__SOURCE__) == RCC_I3C1CLKSOURCE_CSI))

#define IS_RCC_LPTIM1CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_LPTIM1CLKSOURCE_PCLK1) || \
   ((__SOURCE__) == RCC_LPTIM1CLKSOURCE_PLL2P) || \
   ((__SOURCE__) == RCC_LPTIM1CLKSOURCE_PLL3R) || \
   ((__SOURCE__) == RCC_LPTIM1CLKSOURCE_LSE)   || \
   ((__SOURCE__) == RCC_LPTIM1CLKSOURCE_LSI)   || \
   ((__SOURCE__) == RCC_LPTIM1CLKSOURCE_CLKP))

#define IS_RCC_LPTIM23CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_LPTIM23CLKSOURCE_PCLK4) || \
   ((__SOURCE__) == RCC_LPTIM23CLKSOURCE_PLL2P) || \
   ((__SOURCE__) == RCC_LPTIM23CLKSOURCE_PLL3R) || \
   ((__SOURCE__) == RCC_LPTIM23CLKSOURCE_LSE)   || \
   ((__SOURCE__) == RCC_LPTIM23CLKSOURCE_LSI)   || \
   ((__SOURCE__) == RCC_LPTIM23CLKSOURCE_CLKP))

#define IS_RCC_LPTIM45CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_LPTIM45CLKSOURCE_PCLK4) || \
   ((__SOURCE__) == RCC_LPTIM45CLKSOURCE_PLL2P) || \
   ((__SOURCE__) == RCC_LPTIM45CLKSOURCE_PLL3R) || \
   ((__SOURCE__) == RCC_LPTIM45CLKSOURCE_LSE)   || \
   ((__SOURCE__) == RCC_LPTIM45CLKSOURCE_LSI)   || \
   ((__SOURCE__) == RCC_LPTIM45CLKSOURCE_CLKP))

