RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_hal_rcc_ex.h
#define IS_RCC_LPUART1CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_LPUART1CLKSOURCE_PCLK4) || \
   ((__SOURCE__) == RCC_LPUART1CLKSOURCE_PLL2Q) || \
   ((__SOURCE__) == RCC_LPUART1CLKSOURCE_PLL3Q) || \
   ((__SOURCE__) == RCC_LPUART1CLKSOURCE_HSI)   || \
   ((__SOURCE__) == RCC_LPUART1CLKSOURCE_CSI)   || \
   ((__SOURCE__) == RCC_LPUART1CLKSOURCE_LSE))

#define IS_RCC_LTDCCLKSOURCE(__SOURCE__) \
  ((__SOURCE__) == RCC_LTDCCLKSOURCE_PLL3R)

#define IS_RCC_XSPI1CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_XSPI1CLKSOURCE_HCLK)  || \
   ((__SOURCE__) == RCC_XSPI1CLKSOURCE_PLL2S) || \
   ((__SOURCE__) == RCC_XSPI1CLKSOURCE_PLL2T))

#define IS_RCC_XSPI2CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_XSPI2CLKSOURCE_HCLK)  || \
   ((__SOURCE__) == RCC_XSPI2CLKSOURCE_PLL2S) || \
   ((__SOURCE__) == RCC_XSPI2CLKSOURCE_PLL2T))

#define IS_RCC_PSSICLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_PSSICLKSOURCE_PLL3R) || \
   ((__SOURCE__) == RCC_PSSICLKSOURCE_CLKP))

#define IS_RCC_SAI1CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_SAI1CLKSOURCE_PLL1Q) || \
   ((__SOURCE__) == RCC_SAI1CLKSOURCE_PLL2P) || \
   ((__SOURCE__) == RCC_SAI1CLKSOURCE_PLL3P) || \
   ((__SOURCE__) == RCC_SAI1CLKSOURCE_CLKP)  || \
   ((__SOURCE__) == RCC_SAI1CLKSOURCE_PIN))

#define IS_RCC_SAI2CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_SAI2CLKSOURCE_PLL1Q) || \
   ((__SOURCE__) == RCC_SAI2CLKSOURCE_PLL2P) || \
   ((__SOURCE__) == RCC_SAI2CLKSOURCE_PLL3P) || \
   ((__SOURCE__) == RCC_SAI2CLKSOURCE_CLKP)  || \
   ((__SOURCE__) == RCC_SAI2CLKSOURCE_PIN)   || \
   ((__SOURCE__) == RCC_SAI2CLKSOURCE_SPDIF))

#define IS_RCC_SDMMC12CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_SDMMC12CLKSOURCE_PLL2S)  || \
   ((__SOURCE__) == RCC_SDMMC12CLKSOURCE_PLL2T))

#define IS_RCC_SPDIFRXCLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_SPDIFRXCLKSOURCE_PLL1Q) || \
   ((__SOURCE__) == RCC_SPDIFRXCLKSOURCE_PLL2R) || \
   ((__SOURCE__) == RCC_SPDIFRXCLKSOURCE_PLL3R) || \
   ((__SOURCE__) == RCC_SPDIFRXCLKSOURCE_HSI))

#define IS_RCC_SPI1CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_SPI1CLKSOURCE_PLL1Q) || \
   ((__SOURCE__) == RCC_SPI1CLKSOURCE_PLL2P) || \
   ((__SOURCE__) == RCC_SPI1CLKSOURCE_PLL3P) || \
   ((__SOURCE__) == RCC_SPI1CLKSOURCE_PIN)   || \
   ((__SOURCE__) == RCC_SPI1CLKSOURCE_CLKP))

#define IS_RCC_SPI23CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_SPI23CLKSOURCE_PLL1Q) || \
   ((__SOURCE__) == RCC_SPI23CLKSOURCE_PLL2P) || \
   ((__SOURCE__) == RCC_SPI23CLKSOURCE_PLL3P) || \
   ((__SOURCE__) == RCC_SPI23CLKSOURCE_PIN)   || \
   ((__SOURCE__) == RCC_SPI23CLKSOURCE_CLKP))

#define IS_RCC_SPI45CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_SPI45CLKSOURCE_PCLK2) || \
   ((__SOURCE__) == RCC_SPI45CLKSOURCE_PLL2Q) || \
   ((__SOURCE__) == RCC_SPI45CLKSOURCE_PLL3Q) || \
   ((__SOURCE__) == RCC_SPI45CLKSOURCE_HSI)   || \
   ((__SOURCE__) == RCC_SPI45CLKSOURCE_CSI)   || \
   ((__SOURCE__) == RCC_SPI45CLKSOURCE_HSE))

#define IS_RCC_SPI6CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_SPI6CLKSOURCE_PCLK4) || \
   ((__SOURCE__) == RCC_SPI6CLKSOURCE_PLL2Q) || \
   ((__SOURCE__) == RCC_SPI6CLKSOURCE_PLL3Q) || \
   ((__SOURCE__) == RCC_SPI6CLKSOURCE_HSI)   || \
   ((__SOURCE__) == RCC_SPI6CLKSOURCE_CSI)   || \
   ((__SOURCE__) == RCC_SPI6CLKSOURCE_HSE))

#define IS_RCC_USART1CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_USART1CLKSOURCE_PCLK2) || \
   ((__SOURCE__) == RCC_USART1CLKSOURCE_PLL2Q) || \
   ((__SOURCE__) == RCC_USART1CLKSOURCE_PLL3Q) || \
   ((__SOURCE__) == RCC_USART1CLKSOURCE_HSI)   || \
   ((__SOURCE__) == RCC_USART1CLKSOURCE_CSI)   || \
   ((__SOURCE__) == RCC_USART1CLKSOURCE_LSE))

#define IS_RCC_USART234578CLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_USART234578CLKSOURCE_PCLK1) || \
   ((__SOURCE__) == RCC_USART234578CLKSOURCE_PLL2Q) || \
   ((__SOURCE__) == RCC_USART234578CLKSOURCE_PLL3Q) || \
   ((__SOURCE__) == RCC_USART234578CLKSOURCE_HSI)   || \
   ((__SOURCE__) == RCC_USART234578CLKSOURCE_LSE)   || \
   ((__SOURCE__) == RCC_USART234578CLKSOURCE_CSI))

#define IS_RCC_USBPHYCCLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_USBPHYCCLKSOURCE_HSE)      || \
   ((__SOURCE__) == RCC_USBPHYCCLKSOURCE_HSE_DIV2) || \
   ((__SOURCE__) == RCC_USBPHYCCLKSOURCE_PLL3Q))

#define IS_RCC_USBOTGFSCLKSOURCE(__SOURCE__) \
  (((__SOURCE__) == RCC_USBOTGFSCLKSOURCE_HSI48) || \
   ((__SOURCE__) == RCC_USBOTGFSCLKSOURCE_PLL3Q) || \
   ((__SOURCE__) == RCC_USBOTGFSCLKSOURCE_HSE)   || \
   ((__SOURCE__) == RCC_USBOTGFSCLKSOURCE_CLK48))

#define IS_RCC_TIMCLKPRESCALER(__VALUE__)  \
  (((__VALUE__) == RCC_TIMPRES_DISABLE) || \
   ((__VALUE__) == RCC_TIMPRES_ENABLE))

#define IS_RCC_CLOCKPROTECTION(__CLOCK__) \
  ((((__CLOCK__) & RCC_CLOCKPROTECT_FMC) == RCC_CLOCKPROTECT_FMC) || \
   (((__CLOCK__) & RCC_CLOCKPROTECT_XSPI) == RCC_CLOCKPROTECT_XSPI) || \
   (((__CLOCK__) & ~(RCC_CLOCKPROTECT_FMC | RCC_CLOCKPROTECT_XSPI)) == 0U))


#define IS_RCC_CRS_SYNC_SOURCE(__SOURCE__) (((__SOURCE__) == RCC_CRS_SYNC_SOURCE_LSE)  || \
                                            ((__SOURCE__) == RCC_CRS_SYNC_SOURCE_USB_OTG_FS) || \
                                            ((__SOURCE__) == RCC_CRS_SYNC_SOURCE_USB_OTG_HS) || \
                                            ((__SOURCE__) == RCC_CRS_SYNC_SOURCE_GPIO))

#define IS_RCC_CRS_SYNC_DIV(__DIV__)       (((__DIV__) == RCC_CRS_SYNC_DIV1)  || ((__DIV__) == RCC_CRS_SYNC_DIV2)  || \
                                            ((__DIV__) == RCC_CRS_SYNC_DIV4)  || ((__DIV__) == RCC_CRS_SYNC_DIV8)  || \
                                            ((__DIV__) == RCC_CRS_SYNC_DIV16) || ((__DIV__) == RCC_CRS_SYNC_DIV32) || \
                                            ((__DIV__) == RCC_CRS_SYNC_DIV64) || ((__DIV__) == RCC_CRS_SYNC_DIV128))

#define IS_RCC_CRS_SYNC_POLARITY(__POLARITY__) (((__POLARITY__) == RCC_CRS_SYNC_POLARITY_RISING) || \
                                                ((__POLARITY__) == RCC_CRS_SYNC_POLARITY_FALLING))

#define IS_RCC_CRS_RELOADVALUE(__VALUE__)  ((__VALUE__) <= CRS_CFGR_RELOAD)

#define IS_RCC_CRS_ERRORLIMIT(__VALUE__)   ((__VALUE__) <= (CRS_CFGR_FELIM >> CRS_CFGR_FELIM_Pos))

#define IS_RCC_CRS_HSI48CALIBRATION(__VALUE__) ((__VALUE__) <= (CRS_CR_TRIM >> CRS_CR_TRIM_Pos))

#define IS_RCC_CRS_FREQERRORDIR(__DIR__)   (((__DIR__) == RCC_CRS_FREQERRORDIR_UP) || \
                                            ((__DIR__) == RCC_CRS_FREQERRORDIR_DOWN))
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
#ifdef __cplusplus
}
#endif

#endif /* STM32H7RSxx_HAL_RCC_EX_H */
